Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКонструкторПоУмолчанию");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКонструкторСЗаголовкамиИПолезнойНагрузкой");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокена");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСКлючом");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаБезКлюча");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьОшибкуПриПодписиБезКлюча");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСОднимПолучателем");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСДвумяПолучателями");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаCРазличнымиТипамиЗначений");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьКонструкторПоУмолчанию() Экспорт

	Токен = Новый ТокенДоступа();
	
	юТест.ПроверитьРавенство(Токен.ВремяЖизни, 0);
	юТест.ПроверитьРавенство(Токен.ВремяСоздания, 0);
	юТест.ПроверитьРавенство(Токен.Идентификатор, "");
	юТест.ПроверитьРавенство(Токен.КлючСопоставленияПользователя, "");
	юТест.ПроверитьРавенство(Токен.Эмитент, "");
	юТест.ПроверитьРавенство(Токен.Заголовки.Количество(), 0);
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка.Количество(), 0);
	юТест.ПроверитьРавенство(Токен.Получатели.Количество(), 0);

	РазобранныйТокен = РазобратьJWT(Токен);
	юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, "{""alg"":""none""}", "Заголовки");
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{}", "Полезная нагрузка");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКонструкторСЗаголовкамиИПолезнойНагрузкой() Экспорт

    Заголовки = Новый Соответствие;
	Заголовки["typ"] = "JWT";
	Заголовки["any"] = "some";
	
	ПолезнаяНагрузка = Новый Соответствие;
	ПолезнаяНагрузка["sub"] = "user123";
	ПолезнаяНагрузка["name"] = "Test User";
	
	Токен = Новый ТокенДоступа(Заголовки, ПолезнаяНагрузка);
	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(Токен.Заголовки.Количество(), 2);
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка.Количество(), 2);
	юТест.ПроверитьРавенство(Токен.Заголовки["typ"], "JWT");
	юТест.ПроверитьРавенство(Токен.Заголовки["any"], "some");
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка["sub"], "user123");
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка["name"], "Test User");
	юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, "{""alg"":""none"",""typ"":""JWT"",""any"":""some""}", "Заголовки");
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""sub"":""user123"",""name"":""Test User""}", "Полезная нагрузка");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокена() Экспорт

	Токен = Новый ТокенДоступа();
	Токен.ВремяЖизни = 3600;
	Токен.ВремяСоздания = 1640995200; // 2022-01-01 00:00:00 UTC
	Токен.Идентификатор = "unique-token-id";
	Токен.КлючСопоставленияПользователя = "john.doe@example.com";
	Токен.Эмитент = "https://auth.example.com";
	
	Токен.Заголовки["typ"] = "JWT";
	
	Токен.ПолезнаяНагрузка["role"] = "admin";
	Токен.ПолезнаяНагрузка["permissions"] = "read,write,delete";
	
	Токен.Получатели.Добавить("api.example.com");
	Токен.Получатели.Добавить("mobile.app");

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, "{""alg"":""none"",""typ"":""JWT""}", "Заголовки");
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""iss"":""https://auth.example.com"",""iat"":1640995200,""nbf"":1640995200,""exp"":1640998800,""jti"":""unique-token-id"",""sub"":""john.doe@example.com"",""aud"":[""api.example.com"",""mobile.app""],""role"":""admin"",""permissions"":""read,write,delete""}", "Полезная нагрузка");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСКлючом() Экспорт

    ПриватныйКлючRSA = ПрочитатьТекстовыйФайл("./test_rsa_key.pem");
    ПриватныйКлючECDSA = ПрочитатьТекстовыйФайл("./test_ecdsa_key.pem");

	ТестовыеСлучаи = Новый Соответствие();
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES256, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES384, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES512, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS512, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS512, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS512, ПриватныйКлючRSA);

	Токен = ТестовыйТокенДоступа();
	ОжидаемыеЧастиТокена = ОжидаемыеЧастиТестовогоТокена();
	
	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл
		Алгоритм = ТестовыйСлучай.Ключ;
		ПриватныйКлюч = ТестовыйСлучай.Значение;

		Токен.Подписать(Алгоритм, ПриватныйКлюч);

		РазобранныйТокен = РазобратьJWT(Токен);

		юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, СтрШаблон(ОжидаемыеЧастиТокена.Заголовки, Алгоритм), "Заголовки для " + Алгоритм);
		юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемыеЧастиТокена.ПолезнаяНагрузка, "Полезная нагрузка для " + Алгоритм);
		юТест.ПроверитьЗаполненность(РазобранныйТокен.Сигнатура, "Сигнатура для " + Алгоритм);
	КонецЦикла;	

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаБезКлюча() Экспорт

	Токен = ТестовыйТокенДоступа();
	Токен.Подписать(АлгоритмПодписиТокенаДоступа.Нет);

	РазобранныйТокен = РазобратьJWT(Токен);
	ОжидаемыеЧастиТокена = ОжидаемыеЧастиТестовогоТокена();
	
	юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, СтрШаблон(ОжидаемыеЧастиТокена.Заголовки, "none"), "Заголовки");
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемыеЧастиТокена.ПолезнаяНагрузка, "Полезная нагрузка");
	юТест.ПроверитьНеЗаполненность(РазобранныйТокен.Сигнатура, "Сигнатура");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСОднимПолучателем() Экспорт

	Токен = Новый ТокенДоступа();
	Токен.Получатели.Добавить("mobile.app");

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""aud"":""mobile.app""}");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСДвумяПолучателями() Экспорт

	Токен = Новый ТокенДоступа();
	Токен.Получатели.Добавить("api.example.com");
	Токен.Получатели.Добавить("mobile.app");

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""aud"":[""api.example.com"",""mobile.app""]}");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаCРазличнымиТипамиЗначений() Экспорт

	ОжидаемоеЗначение = "{""Число"":1000.10,""Булево"":true,""Дата"":""2001-01-01T17:20:20.0000000Z"",""Нуль"":"""",""Неопределено"":"""",""Массив"":[100,{""Ключ1"":""Значение1""},{""Ключ2"":""Значение2"",""Структура"":{""Ключ1"":""Значение1""}}],""Структура"":{""Ключ1"":""Значение1""},""Соответствие"":{""Ключ2"":""Значение2"",""Структура"":{""Ключ1"":""Значение1""}}}";
	
	Структура = Новый Структура("Ключ1", "Значение1");

	Соответствие = Новый Соответствие();
	Соответствие.Вставить("Ключ2", "Значение2");
	Соответствие.Вставить("Структура", Структура);

	Массив = Новый Массив();
	Массив.Добавить(100);
	Массив.Добавить(Структура);
	Массив.Добавить(Соответствие);

	Токен = Новый ТокенДоступа();
	Токен.ПолезнаяНагрузка.Вставить("Число", 1000.10);
	Токен.ПолезнаяНагрузка.Вставить("Булево", Истина);
	Токен.ПолезнаяНагрузка.Вставить("Дата", Дата(2001, 1, 1, 20, 20, 20));
	Токен.ПолезнаяНагрузка.Вставить("Нуль", null);
	Токен.ПолезнаяНагрузка.Вставить("Неопределено", Неопределено);
	Токен.ПолезнаяНагрузка.Вставить("Массив", Массив);
	Токен.ПолезнаяНагрузка.Вставить("Структура", Структура);
	Токен.ПолезнаяНагрузка.Вставить("Соответствие", Соответствие);

	РазобранныйТокен = РазобратьJWT(Токен);

	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемоеЗначение);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОшибкуПриПодписиБезКлюча() Экспорт
	юТест.ПроверитьКодСОшибкой(
		"Токен = Новый ТокенДоступа();
		|Токен.Подписать(АлгоритмПодписиТокенаДоступа.ES256)", 
		"Ключ подписи не может быть пустым для выбранного алгоритма", 
		"Должна была возникнуть ошибка при подписи без ключа"
	);
КонецПроцедуры

Функция ТестовыйТокенДоступа()

	Токен = Новый ТокенДоступа();
	Токен.ВремяЖизни = 3600;
	Токен.ВремяСоздания = 1640995200; // 2022-01-01 00:00:00 UTC
	Токен.Идентификатор = "unique-token-id";
	Токен.КлючСопоставленияПользователя = "john.doe@example.com";
	Токен.Эмитент = "https://auth.example.com";
	
	Токен.Заголовки["typ"] = "JWT";
	
	Токен.ПолезнаяНагрузка["role"] = "admin";
	Токен.ПолезнаяНагрузка["permissions"] = "read,write,delete";
	
	Токен.Получатели.Добавить("api.example.com");
	Токен.Получатели.Добавить("mobile.app");

	Возврат Токен;

КонецФункции

Функция ОжидаемыеЧастиТестовогоТокена()

	ОжидаемыеЗаголовки = "{""alg"":""%1"",""typ"":""JWT""}";
	ОжидаемаяПолезнаяНагрузка = "{""iss"":""https://auth.example.com"",""iat"":1640995200,""nbf"":1640995200,""exp"":1640998800,""jti"":""unique-token-id"",""sub"":""john.doe@example.com"",""aud"":[""api.example.com"",""mobile.app""],""role"":""admin"",""permissions"":""read,write,delete""}";

	Возврат Новый Структура("Заголовки, ПолезнаяНагрузка", ОжидаемыеЗаголовки, ОжидаемаяПолезнаяНагрузка);

КонецФункции

Функция РазобратьJWT(Токен)
	
	Части = СтрРазделить(Токен, ".");
	юТест.ПроверитьРавенство(Части.Количество(), 3, "Количество частей");
	
	Результат = Новый Структура("Заголовки, ПолезнаяНагрузка, Сигнатура");
	Результат.Заголовки = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(НормализоватьBase64(Части[0])));
	Результат.ПолезнаяНагрузка = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(НормализоватьBase64(Части[1])));
	Результат.Сигнатура = Части[2];

	Возврат Результат;

КонецФункции

Функция НормализоватьBase64(Знач Значение)
	
	Значение = СтрЗаменить(Значение, "-", "+");
	Значение = СтрЗаменить(Значение, "_", "/");
	
	Длина = СтрДлина(Значение);
	Остаток = Длина % 4;
	Паддинг = "";

	Если Остаток = 2 Тогда
		Паддинг = "==";
	ИначеЕсли Остаток = 3 Тогда
		Паддинг = "=";	
	КонецЕсли;

	Возврат Значение + Паддинг;

КонецФункции

Функция ПрочитатьТекстовыйФайл(ОтносительныйПуть)
	ПутьКФайлу = ОбъединитьПути(ТекущийСценарий().Каталог, ОтносительныйПуть);
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу);
	Возврат ЧтениеТекста.Прочитать();
КонецФункции