// Скрипт получает текстовый файл и сортирует в нём строки
ФайлДанных = ВебЗапрос.Файлы.Получить("RequestedFile");

Если ФайлДанных = Неопределено Тогда

	Сообщить("Нет файла данных");
	ЗавершитьРаботу(1);
	
КонецЕсли;

ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
ФайлДанных.Данные.Записать(ИмяВременногоФайла);

Текст = Новый ТекстовыйДокумент;
Текст.Прочитать(ИмяВременногоФайла);

Таблица = Новый ТаблицаЗначений;
Таблица.Колонки.Добавить("Строка");

Для Инд = 1 По Текст.КоличествоСтрок() Цикл

	Таблица.Добавить().Строка = Текст.ПолучитьСтроку(Инд);

КонецЦикла;

Таблица.Сортировать("Строка");

Для Каждого мСтрока Из Таблица Цикл

	Сообщить(мСтрока.Строка);

КонецЦикла;
