#native

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ИзменениеМассиваПоСсылке");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ИзменениеМассиваПоСсылке() Экспорт
    
    МойМассив = Новый Массив;

    ДобавитьВМассив(МойМассив);

    Значение = МойМассив[0];
    
    юТест.ПроверитьРавенство(Значение, 1, "Массив изменен корректно");

КонецПроцедуры

Процедура ДобавитьВМассив(Массив)
	Массив.Добавить(1);
КонецПроцедуры
