#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;
    
    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ПроверитьСозданиеОбъекта_ИзНативногоКласса");
    Тесты.Добавить("ТестДолжен_ПроверитьПодключениеСценария");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовМетодовСПараметрамиПоУмолчанию");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ПроверитьСозданиеОбъекта_ИзНативногоКласса() Экспорт
    ТестовыйСценарий = Новый ТестовыйСценарий;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПодключениеСценария() Экспорт
    ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "Классы", "ТестовыйСценарий.os"), "ПодключенныйСценарий");
    
    ТестовыйСценарий = Новый ПодключенныйСценарий;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовМетодовСПараметрамиПоУмолчанию() Экспорт
    Сценарий = Новый ПараметрыПоУмолчанию;
    
    Результат1 = Сценарий.МетодБулево();
    Результат2 = Сценарий.МетодБулево(Истина);
    Результат3 = Сценарий.МетодБулево(Ложь);
    
    Если НЕ Результат1 = 1 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
    
    Если НЕ Результат2 = 1 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
    
    Если НЕ Результат3 = 0 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
КонецПроцедуры