#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьСтрока");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьСтрока() Экспорт
    
    Сценарий = Новый ПараметрыПоУмолчанию;

    Результат = Сценарий.МетодСтроки(,"Текст");

    юТест.ПроверитьРавенство(Результат, "Т1 Текст", "Текст сформирован корректно");

КонецПроцедуры
