#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;
    
    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ПроверитьСозданиеОбъекта_ИзНативногоКласса");
    Тесты.Добавить("ТестДолжен_ПроверитьПодключениеСценария");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовМетодовСПараметрамиПоУмолчанию");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовМетодовСПропущеннымиПараметрами");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовМетодовСОшибочноПропущеннымиПараметрами");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовМетодовСЛишнимиПараметрами");
    Тесты.Добавить("ТестДолжен_ПроверитьВызовКонструктораСПараметрамиПоУмолчанию");
    Тесты.Добавить("ТестДолжен_ПроверитьПодключениеСценарияСОбъявленнойПеременной");
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ПроверитьСозданиеОбъекта_ИзНативногоКласса() Экспорт
    ТестовыйСценарий = Новый ТестовыйСценарий;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПодключениеСценария() Экспорт
    ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "Классы", "ТестовыйСценарий.os"), "ПодключенныйСценарий");
    
    ТестовыйСценарий = Новый ПодключенныйСценарий;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовМетодовСПараметрамиПоУмолчанию() Экспорт
    Сценарий = Новый ПараметрыПоУмолчанию;
    
    Результат1 = Сценарий.МетодБулево();
    Результат2 = Сценарий.МетодБулево(Истина);
    Результат3 = Сценарий.МетодБулево(Ложь);
    
    Если НЕ Результат1 = 1 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
    
    Если НЕ Результат2 = 1 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
    
    Если НЕ Результат3 = 0 Тогда
    	ВызватьИсключение "Ошибка передачи параметра";
    КонецЕсли;
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовМетодовСПропущеннымиПараметрами() Экспорт
    Сценарий = Новый ПараметрыПоУмолчанию;
    
    Результат = Сценарий.МетодЧисло(,2);
	
	юТест.ПроверитьРавенство(Результат, 1, "Ошибка передачи пропущенного параметра");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовМетодовСОшибочноПропущеннымиПараметрами() Экспорт
    Сценарий = Новый ПараметрыПоУмолчанию;

    ОК = Ложь;
	Ошибка = "";
	Попытка
		Результат = Сценарий.МетодЧисло(1,);
	Исключение
		Ошибка = ИнформацияОбОшибке().Описание;
		ОК = СтрНайти(Ошибка,"Пропущен") > 0;
	КонецПопытки;
	
	юТест.ПроверитьИстину(ОК, "Не было исключения о пропущенном параметре."+Ошибка);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовМетодовСЛишнимиПараметрами() Экспорт
    Сценарий = Новый ПараметрыПоУмолчанию;

    ОК = Ложь;
	Ошибка = "";
	Попытка
		Результат = Сценарий.МетодЧисло(1,2,3);
	Исключение
		Ошибка = ИнформацияОбОшибке().Описание;
		ОК = СтрНайти(Ошибка,"Слишком много") > 0;
	КонецПопытки;
	
	юТест.ПроверитьИстину(ОК, "Не было исключения о лишнем параметре."+Ошибка);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовКонструктораСПараметрамиПоУмолчанию() Экспорт
    Сценарий = Новый ПараметрыКонструктораПоУмолчанию("Парам1");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПодключениеСценарияСОбъявленнойПеременной() Экспорт
	Перем Сценарий;
	Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "Классы", "ТестовыйСценарий.os"));
	юТест.ПроверитьРавенство(Сценарий.Поле1, 1);
КонецПроцедуры

