#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьНеопределено");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьНеопределено() Экспорт
    
    Сценарий = Новый ПараметрыПоУмолчанию;

    Результат1 = Сценарий.МетодНеопределено();
    Результат2 = Сценарий.МетодНеопределено(Неопределено);
    Результат3 = Сценарий.МетодНеопределено(Ложь);

    юТест.ПроверитьРавенство(Результат1, 1, "параметр передан корректно");
    юТест.ПроверитьРавенство(Результат2, 1, "параметр передан корректно");
    юТест.ПроверитьРавенство(Результат3, 0, "параметр передан корректно");

КонецПроцедуры
