#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ПроверитьПередачуЗначенияВКонструктор");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ПроверитьПередачуЗначенияВКонструктор() Экспорт
    
    НужныйОбъект = Новый СценарийСТекстомВКонструкторе("1");

    юТест.ПроверитьРавенство(НужныйОбъект.Поле1, "1", "параметр передан корректно");

КонецПроцедуры
