#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьБулево");
    
    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ЗначенияВМетодахПоУмолчаниюИспользоватьБулево() Экспорт
    
    Сценарий = Новый ПараметрыПоУмолчанию;
    
    Результат1 = Сценарий.МетодБулево();
    Результат2 = Сценарий.МетодБулево(Истина);
    Результат3 = Сценарий.МетодБулево(Ложь);

    юТест.ПроверитьРавенство(Результат1, 1, "параметр передан корректно");
    юТест.ПроверитьРавенство(Результат2, 1, "параметр передан корректно");
    юТест.ПроверитьРавенство(Результат3, 0, "параметр передан корректно");

КонецПроцедуры
