#native
#Использовать "."

Перем юТест;

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;

    Тесты = Новый Массив;
    Тесты.Добавить("ТестДолжен_ПроверитьКоличество_Массив");
    Тесты.Добавить("ТестДолжен_ПроверитьКоличество_Структура");
    Тесты.Добавить("ТестДолжен_ПроверитьКоличество_СписокЗначений");
    Тесты.Добавить("ТестДолжен_ПроверитьКоличество_Соответствие");
    Тесты.Добавить("ТестДолжен_ПроверитьКоличество_ТаблицаЗначений");

    Возврат Тесты;
    
КонецФункции

Процедура ТестДолжен_ПроверитьКоличество_Массив() Экспорт
    
    // Дано
    Коллекция = Новый Массив();

    // Когда
    Количество = Коллекция.Количество();

    // Тогда

    юТест.ПроверитьРавенство(Количество, 0, "Количество получено");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличество_Структура() Экспорт
    
    // Дано
    Коллекция = Новый Структура();

    // Когда
    Количество = Коллекция.Количество();

    // Тогда

    юТест.ПроверитьРавенство(Количество, 0, "Количество получено");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличество_СписокЗначений() Экспорт
    
    // Дано
    Коллекция = Новый СписокЗначений();

    // Когда
    Количество = Коллекция.Количество();

    // Тогда

    юТест.ПроверитьРавенство(Количество, 0, "Количество получено");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличество_Соответствие() Экспорт
    
    // Дано
    Коллекция = Новый Соответствие();

    // Когда
    Количество = Коллекция.Количество();

    // Тогда

    юТест.ПроверитьРавенство(Количество, 0, "Количество получено");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличество_ТаблицаЗначений() Экспорт
    
    // Дано
    Коллекция = Новый ТаблицаЗначений();

    // Когда
    Количество = Коллекция.Количество();
    КоличествоКолонок = Коллекция.Колонки.Количество();

    // Тогда

    юТест.ПроверитьРавенство(Количество, 0, "Количество получено");
    юТест.ПроверитьРавенство(КоличествоКолонок, 0, "Количество получено");

КонецПроцедуры
