СредстваТелеграм = Новый СредстваТелеграм;
КлиентБот = СредстваТелеграм.НовыйКлиентТелеграмБот("483895781:AAGaRncTOlvMYHnZs14V9Y2Dgo92zlbricw");
//КлиентБот = СредстваТелеграм.НовыйКлиентТелеграмБот(Неопределено);
МойПользователь = КлиентБот.ПолучитьМоегоПользователя();
Сообщить(МойПользователь.Имя);
Сообщить(МойПользователь.ПолучитьМоегоПользователя(Неопределено, Неопределено, Неопределено) = Неопределено);
//Сообщить(Строка(МойПользователь.Имя) + " " + Строка(МойПользователь.Идентификатор) + " " + Строка(МойПользователь.КодЯзыка));
