//////////////////////////////////////////////////////////////////
// 
// Объект-помощник для приемочного и юнит-тестирования
//
//////////////////////////////////////////////////////////////////

Перем РезультатТестирования;

Перем Рефлектор;

Перем ЗначенияСостоянияТестов;

Перем	НаборОшибок;
Перем	НаборНереализованныхТестов;

Перем	ВыводитьОшибкиПодробно;

Перем ВременныеФайлы;

Перем ИспользоватьСборСтатистикиСкриптовOnescript;
Перем КаталогСбораСтатистики;

#Область ПрограммныйИнтерфейс

Процедура ПодробныеОписанияОшибок(Знач ВключитьПодробноеОписание) Экспорт
	ВыводитьОшибкиПодробно = ВключитьПодробноеОписание;
КонецПроцедуры

// Включить сбор статистики и покрытия кода для передачи в вызываемые команды запуска oscript
//
Процедура ВключитьСборСтатистикиСкриптовOnescript(Знач ПарамКаталогСбораСтатистики) Экспорт
	ИспользоватьСборСтатистикиСкриптовOnescript = Истина;
	КаталогСбораСтатистики = ПарамКаталогСбораСтатистики;
КонецПроцедуры

// Использовать сбор статистики скриптов Onescript
//
//  Возвращаемое значение:
//   Булево -
//
Функция ИспользоватьСборСтатистикиСкриптовOnescript() Экспорт
	Возврат ИспользоватьСборСтатистикиСкриптовOnescript;
КонецФункции

// Получить каталог сбора статистики скриптов Onescript
//
//  Возвращаемое значение:
//   Файл, Неопределено - каталог сбора статистики или Неопределено, если статистика не собирается
//
Функция КаталогСбораСтатистикиСкриптовOnescript() Экспорт
	Возврат КаталогСбораСтатистики;
КонецФункции

// Включить отладку в логах запускаемых скриптов Onescript
//
Процедура ВключитьОтладкуВЛогахЗапускаемыхСкриптовOnescript() Экспорт
	УстановитьПеременнуюСреды("LOGOS_LEVEL", "DEBUG");
КонецПроцедуры

// Выключить отладку в логах запускаемых скриптов Onescript
//
Процедура ВыключитьОтладкуВЛогахЗапускаемыхСкриптовOnescript() Экспорт
	УстановитьПеременнуюСреды("LOGOS_LEVEL", "");
КонецПроцедуры

#КонецОбласти

#Область Assertions 

Функция ФорматДСО(ДопСообщениеОшибки)
	Если ДопСообщениеОшибки = "" Тогда
		Возврат "";
	КонецЕсли;

	Возврат Символы.ПС + ДопСообщениеОшибки;
КонецФункции

Функция ПредставлениеПериода(ДатаНачала, ДатаОкончания, ФорматнаяСтрока = Неопределено)
	Возврат "с "+ДатаНачала+" по "+ДатаОкончания;
КонецФункции

Процедура Проверить(Условие, ДопСообщениеОшибки = "") Экспорт
	Если Не Условие Тогда
		СообщениеОшибки = "Переданный параметр ("+Формат(Условие, "БЛ=ложь; БИ=истина")+") не является Истиной, а хотели, чтобы являлся." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьИстину(Условие, ДопСообщениеОшибки = "") Экспорт
	Проверить(Условие, ДопСообщениеОшибки);
КонецПроцедуры

Процедура ПроверитьЛожь(Условие, ДопСообщениеОшибки = "") Экспорт
	Если Условие Тогда
		СообщениеОшибки = "Переданный параметр ("+Формат(Условие, "БЛ=ложь; БИ=истина")+") не является Ложью, а хотели, чтобы являлся." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьРавенствоДатСТочностью2Секунды(_Дата, _Дата2, ДопСообщениеОшибки = "") Экспорт
	Если _Дата < _Дата2-2 или _Дата > _Дата2+2 Тогда
		СообщениеОшибки = "Переданная дата ("+Формат(_Дата, "ДФ='dd.MM.yyyy HH:mm:ss'")+") не равна дате ("+Формат(_Дата2, "ДФ='dd.MM.yyyy HH:mm:ss'")+") с точностью до 2-х секунд, а хотели, чтобы они равнялись." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьДату(_Дата, _Период, ДопСообщениеОшибки = "") Экспорт
	Если _Дата < _Период.ДатаНачала или _Дата > _Период.ДатаОкончания Тогда
		представление = ПредставлениеПериода(_Период.ДатаНачала, _Период.ДатаОкончания, "ФП = Истина");
		СообщениеОшибки = "Переданный параметр ("+Формат(_Дата, "ДФ='dd.MM.yyyy HH:mm:ss'")+") не входит в период "+представление+", а хотели, чтобы являлся." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьРавенство(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ПервоеЗначение <> ВтороеЗначение Тогда
		Если ТипЗнч(ПервоеЗначение) = Тип("Строка") и ТипЗнч(ВтороеЗначение) = Тип("Строка") Тогда
			ВызватьИсключение ИсключениеНеравенстваСтрок(ПервоеЗначение, ВтороеЗначение) + "
			|" + ДопСообщениеОшибки;
		КонецЕсли;
		
		СообщениеОшибки = "Сравниваемые значения ("+ПервоеЗначение+"; "+ВтороеЗначение+") не равны, а хотели, чтобы были равны." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьРавенствоСтрокБезУчетаРегистра(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если нрег(ПервоеЗначение) <> нрег(ВтороеЗначение) Тогда
		Если ТипЗнч(ПервоеЗначение) = Тип("Строка") и ТипЗнч(ВтороеЗначение) = Тип("Строка") Тогда
			ВызватьИсключение ИсключениеНеравенстваСтрок(ПервоеЗначение, ВтороеЗначение, Истина) + "
			|" + ДопСообщениеОшибки;
		КонецЕсли;
		
		СообщениеОшибки = "Сравниваемые значения ("+ПервоеЗначение+"; "+ВтороеЗначение+") не равны, а хотели, чтобы были равны." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьНеРавенство(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ПервоеЗначение = ВтороеЗначение Тогда
		СообщениеОшибки = "Сравниваемые значения ("+ПервоеЗначение+"; "+ВтороеЗначение+") равны, а хотели, чтобы были не равны." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьБольше(_Больше, _Меньше, ДопСообщениеОшибки = "") Экспорт
	Если _Больше <= _Меньше Тогда
		СообщениеОшибки = "Первый параметр ("+_Больше+") меньше или равен второму ("+_Меньше+") а хотели, чтобы был больше." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьБольшеИлиРавно(_Больше, _Меньше, ДопСообщениеОшибки = "") Экспорт
	Если _Больше < _Меньше Тогда
		СообщениеОшибки = "Первый параметр ("+_Больше+") меньше второго ("+_Меньше+") а хотели, чтобы был больше или равен." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьМеньше(проверяемоеЗначение1, проверяемоеЗначение2, СообщениеОбОшибке = "") Экспорт
	Если проверяемоеЗначение1 >= проверяемоеЗначение2 Тогда
		ВызватьИсключение "Значение <"+проверяемоеЗначение1+"> больше или равно, чем <"+проверяемоеЗначение2+">, а ожидалось меньше"+
				ФорматДСО(СообщениеОбОшибке);
	КонецЕсли; 
КонецПроцедуры

Процедура ПроверитьМеньшеИлиРавно(проверяемоеЗначение1, проверяемоеЗначение2, СообщениеОбОшибке = "") Экспорт
	Если проверяемоеЗначение1 > проверяемоеЗначение2 Тогда
		ВызватьИсключение "Значение <"+проверяемоеЗначение1+"> больше, чем <"+проверяемоеЗначение2+">, а ожидалось меньше или равно"+
				ФорматДСО(СообщениеОбОшибке);
	КонецЕсли; 
КонецПроцедуры

// проверка идет через ЗначениеЗаполнено, но мутабельные значение всегда считаем заполненными
Процедура ПроверитьЗаполненность(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
    Попытка
        фЗаполнено = ЗначениеЗаполнено(ПроверяемоеЗначение);
    Исключение
        Возврат;
    КонецПопытки; 
    Если НЕ фЗаполнено Тогда
        ВызватьИсключение "Значение ("+ПроверяемоеЗначение+") не заполнено, а ожидалась заполненность" + ФорматДСО(ДопСообщениеОшибки);
    КонецЕсли; 
КонецПроцедуры

Процедура ПроверитьНеЗаполненность(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	СообщениеОшибки = "Значение ("+ПроверяемоеЗначение+") заполнено, а ожидалась незаполненность" + ФорматДСО(ДопСообщениеОшибки);
	Попытка
        фЗаполнено = ЗначениеЗаполнено(ПроверяемоеЗначение);
    Исключение
        ВызватьИсключение СообщениеОшибки;
    КонецПопытки; 
    Если фЗаполнено Тогда
        ВызватьИсключение СообщениеОшибки;
    КонецЕсли; 
КонецПроцедуры

Процедура ПроверитьВхождение(строка, подстрокаПоиска, ДопСообщениеОшибки = "") Экспорт
	Если Найти(строка, подстрокаПоиска) = 0 Тогда
		СообщениеОшибки = "Искали в <"+строка+"> подстроку <"+подстрокаПоиска+">, но не нашли." + ФорматДСО(ДопСообщениеОшибки);
		ВызватьИсключение(СообщениеОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьКодСОшибкой( Код, Ошибка, ДопСообщениеОшибки = "" ) Экспорт
	Попытка
		Сценарий = ЗагрузитьСценарийИзСтроки(Код);
		СообщениеОшибки = "Ожидали ошибку '"+Ошибка+"', но ее не было";
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке().Описание;
		Если Найти(ОписаниеОшибки, Ошибка ) = 0 Тогда
			СообщениеОшибки = "Ожидали ошибку '"+Ошибка+"', а была ошибка '"+ОписаниеОшибки+"'";
		Иначе
			Возврат;
		КонецЕсли;
	КонецПопытки;
	ВызватьИсключение(СообщениеОшибки + ФорматДСО(ДопСообщениеОшибки));
КонецПроцедуры

Процедура ПроверитьТип(Значение, ТипИлиИмяТипа, ДопСообщениеОшибки = "") Экспорт
	
	Если ТипЗнч(ТипИлиИмяТипа) = Тип("Строка") Тогда
		ОжидаемыйТип = Тип(ТипИлиИмяТипа);
	ИначеЕсли ТипЗнч(ТипИлиИмяТипа) = Тип("Тип") Тогда
		ОжидаемыйТип = ТипИлиИмяТипа;
	Иначе
		ТекстИсключения = СтрШаблон(
			"ПроверитьТип: Тип значения параметра ТипИлиИмяТипа должен быть <Тип> или <Строка>, а получили <%1>.%2",
			ТипЗнч(ТипИлиИмяТипа),
			ФорматДСО(ДопСообщениеОшибки));
		ВызватьИсключение(ТекстИсключения);
	КонецЕсли;
	Если ТипЗнч(Значение) <> ОжидаемыйТип Тогда
		ОшибкаПроверки = СтрШаблон(
			"Типом значения <%1> является <%2>, а ожидался тип <%3>.%4",
			Значение, ТипЗнч(Значение), ТипИлиИмяТипа, ФорматДСО(ДопСообщениеОшибки));
		ВызватьИсключение(ОшибкаПроверки);
	КонецЕсли;
КонецПроцедуры

Процедура ТестПройден() Экспорт
КонецПроцедуры

Процедура ТестПровален(ДопСообщениеОшибки) Экспорт
	СообщениеОшибки = "Тест провален." + ФорматДСО(ДопСообщениеОшибки);
	ВызватьИсключение(СообщениеОшибки);
КонецПроцедуры

Функция ЭкранироватьПереводыСтрок(Знач Строка)
	Возврат СтрЗаменить(СтрЗаменить(Строка, Символы.ПС, "\n"), Символы.ВК, "\r");
КонецФункции

Функция ИсключениеНеравенстваСтрок(ПервоеЗначение, ВтороеЗначение, Знач БезУчетаРегистра = Ложь)
	ДиапазонОтНачала = 17;
	ДиапазонВКонце   = 17;
	СтрокаНабора = СтрСоединить(Новый Массив(2*ДиапазонОтНачала), " ");

	МинДлина = Мин(СтрДлина(ПервоеЗначение), СтрДлина(ВтороеЗначение));
	ИндексРазличия = МинДлина + 1;
	Для Сч = 1 По МинДлина Цикл
		
		Символ1 = Сред(ПервоеЗначение, Сч, 1);
		Символ2 = Сред(ВтороеЗначение, Сч, 1);
		
		Если БезУчетаРегистра Тогда
			Символ1 = нрег(Символ1);
			Символ2 = нрег(Символ2);
		КонецЕсли;

		Если Символ1 <> Символ2 Тогда
			ИндексРазличия = Сч;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	ОтступНачала = ИндексРазличия - ДиапазонОтНачала;
	Если ОтступНачала <= 0 Тогда
		ОтступНачала = 1;
	КонецЕсли;
	
	ФрагментПервой = Сред(ПервоеЗначение, ОтступНачала, ДиапазонОтНачала);
	ФрагментПервойЭкр = ЭкранироватьПереводыСтрок(ФрагментПервой);

	Префикс = ДиапазонОтНачала;
	Если ИндексРазличия <= ДиапазонОтНачала Тогда
		Префикс = ИндексРазличия - 1;
	КонецЕсли;
	Префикс = Префикс + СтрДлина(ФрагментПервойЭкр) - СтрДлина(ФрагментПервой);

	ФрагментПервойЭкр = ФрагментПервойЭкр +
        ЭкранироватьПереводыСтрок(Сред(ПервоеЗначение, ОтступНачала+ДиапазонОтНачала, ДиапазонВКонце));
    
	ФрагментВторойЭкр = ЭкранироватьПереводыСтрок(Сред(ВтороеЗначение, ОтступНачала, ДиапазонОтНачала+ДиапазонВКонце)); 

	Возврат "Различия в позиции " + ИндексРазличия + ".
	|Ожидали: `" + ФрагментПервойЭкр + "`
	|          " + Лев(СтрокаНабора, Префикс) + "^
	|Получено:`" + ФрагментВторойЭкр + "`";
КонецФункции

#КонецОбласти

#Область ВременныеФайлы

Функция ИмяВременногоФайла(Знач Расширение = "tmp") Экспорт
	Если ВременныеФайлы = Неопределено Тогда
		ВременныеФайлы = Новый Массив;
	КонецЕсли;
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла(Расширение); // BSLLS:MissingTemporaryFileDeletion-off
	ВременныеФайлы.Добавить(ИмяВремФайла);
	Возврат ИмяВремФайла;
КонецФункции

Процедура УдалитьВременныеФайлы() Экспорт

	Если ВременныеФайлы <> Неопределено Тогда
		Для Каждого ИмяФайла Из ВременныеФайлы Цикл
			Попытка
				УдалитьФайлы(ИмяФайла);
			Исключение
				Сообщить("Не удален временный файл: " + ИмяФайла + "
				|-" + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
		ВременныеФайлы.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбнаружениеТестов

// Обнаруживает файлы тестов TestFixtures с точки зрения NUnit
Функция ОбнаружитьКлассыТестов(Знач Каталог) Экспорт

	Пути = Новый Массив;
	НайтиТестыВПодкаталоге(Пути, Каталог);

	ТестовыеКлассы = Новый ТаблицаЗначений();
	ТестовыеКлассы.Колонки.Добавить("Путь");
	ТестовыеКлассы.Колонки.Добавить("ИмяКласса");

	Для Каждого Файл Из Пути Цикл

		СтрОписания = ТестовыеКлассы.Добавить();
		СтрОписания.Путь = Файл.ПолноеИмя;
		СтрОписания.ИмяКласса = ?(
			СтрНачинаетсяС(Файл.ИмяБезРасширения, "test-"),
		 	Сред(Файл.ИмяБезРасширения, СтрДлина("test-")+1),
			Файл.ИмяБезРасширения
		);

	КонецЦикла;

	Возврат ТестовыеКлассы;

КонецФункции

Функция ЗагрузитьИнстансТеста(Знач ПутьТеста) Экспорт
	// Исключения ловим на уровне C# и NUnit
	Возврат ЗагрузитьСценарий(ПутьТеста);
КонецФункции

Процедура НайтиТестыВПодкаталоге(Знач Пути, Знач Подкаталог, Знач Вложенный = Ложь)

	Файлы = НайтиФайлы(Подкаталог, ПолучитьМаскуВсеФайлы());
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ЭтоКаталог() Тогда
			НайтиТестыВПодкаталоге(Файл.ПолноеИмя, Истина);
		ИначеЕсли Файл.Расширение = ".os" И Файл.ИмяБезРасширения <> "testrunner" Тогда
			Если Не Вложенный ИЛИ СтрНачинаетсяС(Файл.ИмяБезРасширения, "test-") Тогда
				Пути.Добавить(Файл);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТестовыеСлучаи(ТестОбъект, ПолноеИмяОбъекта)

	Попытка

		МассивТестовыхСлучаев = ПрочитатьТестовыеСлучаиОбъекта(ТестОбъект, ЭтотОбъект);

	Исключение
		ВывестиОшибку("Набор тестов не загружен: " + ПолноеИмяОбъекта + "
		|	Ошибка получения списка тестовых случаев: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

	Если ТипЗнч(МассивТестовыхСлучаев) <> Тип("Массив") Тогда

		ВывестиОшибку("Набор тестов не загружен: " + ПолноеИмяОбъекта + "
				|	Ошибка получения списка тестовых случаев: вместо массива имен тестовых случаев получен объект <" + Строка(ТипЗнч(МассивТестовыхСлучаев)) + ">");
		ТестОбъект = Неопределено;
		Возврат Неопределено;

	КонецЕсли;

	Если НЕ ПроверитьМассивТестовыхСлучаев(МассивТестовыхСлучаев, ПолноеИмяОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат МассивТестовыхСлучаев;

КонецФункции

Функция ПрочитатьТестовыеСлучаиОбъекта(Знач ТестОбъект, Знач МенеджерТестирования)
	МассивТестовыхСлучаев = ПрочитатьТестовыеСлучаиОбъектаВызовомМетода(ТестОбъект, МенеджерТестирования);
	Если Неопределено <> МассивТестовыхСлучаев Тогда
		Возврат МассивТестовыхСлучаев;
	КонецЕсли;

	МассивТестовыхСлучаев = НайтиАннотированныеТесты(ТестОбъект);

	Возврат МассивТестовыхСлучаев;
КонецФункции

Функция ПроверитьМассивТестовыхСлучаев(МассивТестовыхСлучаев, ПолноеИмяОбъекта)
	Для каждого данныеТеста Из МассивТестовыхСлучаев Цикл
		Если ТипЗнч(данныеТеста) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(данныеТеста) <> Тип("Структура") Тогда
			ВывестиОшибку("Набор тестов не загружен: " + ПолноеИмяОбъекта + "
			|	Ошибка получения структуры описания тестового случая: " + ОписаниеОшибки());
			Возврат Ложь;
		КонецЕсли;
		Если НЕ данныеТеста.Свойство("ИмяТеста") Тогда
			ВывестиОшибку("Набор тестов не загружен: " + ПолноеИмяОбъекта + "
			|	Не задано имя теста в структуре описания тестового случая: " + ОписаниеОшибки());
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ПрочитатьТестовыеСлучаиОбъектаВызовомМетода(Знач ТестОбъект, Знач МенеджерТестирования)

	Если НЕ Рефлектор.МетодСуществует(ТестОбъект, "ПолучитьСписокТестов") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ВремМассивТестовыхСлучаев = Новый Массив;
	МассивТестовыхСлучаев = ТестОбъект.ПолучитьСписокТестов(МенеджерТестирования);
	Если ТипЗнч(МассивТестовыхСлучаев) = Тип("Массив") Тогда
		Для каждого ТестовыйСлучай Из МассивТестовыхСлучаев Цикл
			ВремМассивТестовыхСлучаев.Добавить(ТестовыйСлучай);
		КонецЦикла;
	КонецЕсли;
	МассивТестовыхСлучаев = ВремМассивТестовыхСлучаев;
	ВремМассивТестовыхСлучаев = Неопределено;

	Возврат МассивТестовыхСлучаев;
КонецФункции

#КонецОбласти

Функция ВыполнитьТест(ОписаниеТеста, Сч)
	Перем Рез;

	Тест = ОписаниеТеста.ТестОбъект;
	ИмяМетода = ОписаниеТеста.ИмяМетода;

	Успешно = Истина;
	Если Не Успешно Тогда // TODO странная проверка - только что установили в Истина, и проверяем на Ложь (
		Рез = ЗначенияСостоянияТестов.Сломался;
	Иначе
		Если Не Рефлектор.МетодСуществует(Тест, ИмяМетода) Тогда
			Рез = ВывестиОшибкуВыполненияТеста(ЗначенияСостоянияТестов.НеРеализован, "Не найден тестовый метод "
				+ ИмяМетода, ОписаниеТеста, "", Неопределено);
			Сообщить("  ");
		Иначе
			Попытка
				НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ОписаниеТеста.Делегат.Исполнить();
				ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;

				Рез = ЗначенияСостоянияТестов.Прошел;
			Исключение
				ИнфоОшибки = ИнформацияОбОшибке();

				//уберем стек-трейс, который приезжает из библиотеки asserts
				ОписаниеОшибки = ИнфоОшибки.Описание;
				ПозицияСтрокиСтрекТрейс = Найти(ОписаниеОшибки, "Стек трейс:");
				Если ПозицияСтрокиСтрекТрейс > 0 Тогда
					ОписаниеОшибки = Лев(ОписаниеОшибки, ПозицияСтрокиСтрекТрейс);
				КонецЕсли;

				ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;

				ТекстОшибки = ОписаниеОшибки + "
				|" + ПолучитьОписаниеСтекаВызовов(ИнфоОшибки);

				Если ВыводитьОшибкиПодробно Тогда
					ТекстОшибки = ТекстОшибки + "
					|" + ИнфоОшибки.ПодробноеОписаниеОшибки();
				КонецЕсли;
				Рез = ВывестиОшибкуВыполненияТеста(ЗначенияСостоянияТестов.Сломался, "", ОписаниеТеста,
					ТекстОшибки, ИнфоОшибки);
				Сообщить("  ");
			КонецПопытки;
			Если ОписаниеТеста.Свойство("ВремяВыполнения") Тогда
				ОписаниеТеста.ВремяВыполнения = ОписаниеТеста.ВремяВыполнения + ВремяВыполнения;
			Иначе
				ОписаниеТеста.Вставить("ВремяВыполнения", ВремяВыполнения);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Возврат Рез;
КонецФункции

Функция ВыполнитьПоАннотации(ОписаниеТеста, СтрокаАннотации, ДополнительныйШаг)

	ТестыПеред = Новый Массив;
	ТестыПеред.Добавить(ДополнительныйШаг);

	ТестыПеред = НайтиАннотированныеМетоды(ОписаниеТеста.ТестОбъект, СтрокаАннотации);

	Если ТестыПеред = Неопределено Тогда
		ТестыПеред = Новый Массив;
		ТестыПеред.Добавить(ДополнительныйШаг);
	КонецЕсли;

	Рез = ЗначенияСостоянияТестов.Прошел;
	Для Каждого ШагПередЗапуском Из ТестыПеред Цикл

		Успешно = ВыполнитьПроцедуруТестовогоСлучая(
			ШагПередЗапуском,
			ОписаниеТеста.ТестОбъект,
			ОписаниеТеста
		);

		Если Не Успешно Тогда
			Рез = ЗначенияСостоянияТестов.Сломался;
		КонецЕсли;

	КонецЦикла;

	Возврат Рез;

КонецФункции

Функция ЗагрузитьТесты(Знач Тест, Знач ИмяКласса) Экспорт

    НаборТестов = Новый Массив;
    МассивТестовыхСлучаев = ПолучитьТестовыеСлучаи(Тест, ИмяКласса);
    Если МассивТестовыхСлучаев = Неопределено Тогда
        Возврат НаборТестов;
    КонецЕсли;

    Для Каждого ТестовыйСлучай Из МассивТестовыхСлучаев Цикл
        Если ТипЗнч(ТестовыйСлучай) = Тип("Строка") Тогда
            ИмяТестовогоСлучая = ТестовыйСлучай;
            ПараметрыТеста = Неопределено;
            ПредставлениеТеста = ИмяТестовогоСлучая;
        ИначеЕсли ТипЗнч(ТестовыйСлучай) = Тип("Структура")Тогда
            ИмяТестовогоСлучая = ТестовыйСлучай.ИмяТеста;
            ПараметрыТеста = ТестовыйСлучай.Параметры;
            ПредставлениеТеста = ТестовыйСлучай.Представление;
        Иначе
            ВызватьИсключение "Не умею обрабатывать описание тестового случая из ПолучитьСписокТестов, отличный от строки или структуры";
        КонецЕсли;

        ОписаниеТеста = Новый Структура;
        ОписаниеТеста.Вставить("ТестОбъект", Тест);
        ОписаниеТеста.Вставить("ИмяКласса", ИмяКласса);
        ОписаниеТеста.Вставить("ПолноеИмя", ИмяКласса);
        ОписаниеТеста.Вставить("ИмяМетода", ИмяТестовогоСлучая);
        ОписаниеТеста.Вставить("Представление", ПредставлениеТеста);
        ОписаниеТеста.Вставить("ПараметрыТеста", ПараметрыТеста);

        НаборТестов.Добавить(ОписаниеТеста);

    КонецЦикла;
    
    Возврат НаборТестов;

КонецФункции

// Выполнение всех тестов одного класса
//
Функция ВыполнитьВсеТестыОбъекта(Знач НаборТестов) Экспорт
	
	НаборОшибок = Новый Соответствие;
	НаборНереализованныхТестов = Новый Соответствие;
	
	РезультатТестирования = ЗначенияСостоянияТестов.НеВыполнялся;

	НовыйРезультатТестирования = ВыполнитьПередТестами(НаборТестов);
	РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);

	Для Сч = 0 По НаборТестов.Количество() - 1 Цикл
		ОписаниеТеста = НаборТестов[Сч];
		
		НовыйРезультатТестирования = ВыполнитьПолныйТест(ОписаниеТеста, Сч);
		РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);

	КонецЦикла;

	НовыйРезультатТестирования = ВыполнитьПослеТестов(НаборТестов);
	РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);
	
	Возврат новый Структура("НаборОшибок, НаборНереализованныхТестов, РезультатТестирования",
		НаборОшибок, НаборНереализованныхТестов, РезультатТестирования);

КонецФункции

Функция ЗначенияСостоянияТестов() Экспорт
	Если ЗначенияСостоянияТестов = Неопределено Тогда
		ЗначенияСостоянияТестов = Новый Структура;
		ЗначенияСостоянияТестов.Вставить("НеВыполнялся", -1);
		// код 0 используется в командной строке для показа нормального завершения
		ЗначенияСостоянияТестов.Вставить("Прошел"		, 0);
		ЗначенияСостоянияТестов.Вставить("НеРеализован", 2);
		ЗначенияСостоянияТестов.Вставить("Сломался"	, 3);

		ЗначенияСостоянияТестов = Новый ФиксированнаяСтруктура(ЗначенияСостоянияТестов);
	КонецЕсли;
	Возврат ЗначенияСостоянияТестов;
	// } Состояния тестов
КонецФункции

Функция ЗапомнитьСамоеХудшееСостояние(ТекущееСостояние, НовоеСостояние)

	ТекущееСостояние = Макс(ТекущееСостояние, НовоеСостояние);
	Возврат ТекущееСостояние;

КонецФункции

Функция ВыполнитьПолныйТест(ОписаниеТеста, НомерТеста)

	НовыйРезультатТестирования = ВыполнитьПередТестом(ОписаниеТеста);
	РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);

	НовыйРезультатТестирования = ВыполнитьТест(ОписаниеТеста, НомерТеста);
	РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);

	НовыйРезультатТестирования = ВыполнитьПослеТеста(ОписаниеТеста);
	РезультатТестирования = ЗапомнитьСамоеХудшееСостояние(РезультатТестирования, НовыйРезультатТестирования);

	Возврат РезультатТестирования;
КонецФункции

Функция НайтиАннотированныеМетоды(Знач ТестОбъект, Аннотация)

	ТаблицаМетодов = Рефлектор.ПолучитьТаблицуМетодов(ТестОбъект);
	Если ТаблицаМетодов.Колонки.Найти("Аннотации") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	МассивТестовыхСлучаев = Неопределено;
	ВремМассивТестовыхСлучаев = Новый Массив;
	Для Каждого ТестовыйСлучай Из ТаблицаМетодов Цикл
		ДополнитьМассивПоАннотациям(ВремМассивТестовыхСлучаев, ТестовыйСлучай, Аннотация);
	КонецЦикла;

	Если ВремМассивТестовыхСлучаев.Количество() > 0 Тогда
		МассивТестовыхСлучаев = ВремМассивТестовыхСлучаев;
	КонецЕсли;
	ВремМассивТестовыхСлучаев = Неопределено;

	Возврат МассивТестовыхСлучаев;
КонецФункции

Функция НайтиАннотированныеТесты(Знач ТестОбъект)

	ТаблицаМетодов = Рефлектор.ПолучитьТаблицуМетодов(ТестОбъект);
	Если ТаблицаМетодов.Колонки.Найти("Аннотации") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИмяАннотацииТест = "тест";
	МассивТестовыхСлучаев = Новый Массив;
	Для Каждого МетодКласса Из ТаблицаМетодов Цикл
		
		Если МетодКласса.Аннотации = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ЭтоТест = ЕстьАннотация(МетодКласса.Аннотации, ИмяАннотацииТест);

		Если ЭтоТест Тогда
			ТестовыеСлучаи = ОписаниеТестаПоАннотации(
				МетодКласса.Имя,
				МетодКласса.КоличествоПараметров,
				МетодКласса.Аннотации);

			Если ТипЗнч(ТестовыеСлучаи) = Тип("Строка") Тогда
				МассивТестовыхСлучаев.Добавить(ТестовыеСлучаи);
			Иначе
				Для Каждого Случай Из ТестовыеСлучаи Цикл
					МассивТестовыхСлучаев.Добавить(Случай);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат МассивТестовыхСлучаев;

КонецФункции

Функция НайтиАннотации(Знач Таблица, Знач ИмяАннотации)
	Результат = Новый Массив;
	Для Каждого СтрАннотация Из Таблица Цикл
		Если ВРег(СтрАннотация.Имя) = ВРег(ИмяАннотации) Тогда
			Результат.Добавить(СтрАннотация);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ЕстьАннотация(Знач Таблица, Знач ИмяАннотации)
	Возврат НайтиАннотации(Таблица, ИмяАннотации).Количество() <> 0;
КонецФункции

Функция ОписаниеТестаПоАннотации(Знач ИмяМетода, Знач КоличествоПараметров, Знач Аннотации)

	ИмяАннотацииПараметры = "параметры";
	СтрокиАннотаций = НайтиАннотации(Аннотации, ИмяАннотацииПараметры);
	Если СтрокиАннотаций.Количество() = 0 Тогда
		Возврат ИмяМетода; // не параметризованный тест
	КонецЕсли;

	ТестовыеСлучаи = Новый Массив;
	Для Каждого ВариантТеста Из СтрокиАннотаций Цикл

		ПараметрыАннотации = ВариантТеста.Параметры;
		Если Не ПараметрыАннотации.Количество() Тогда
			ВызватьИсключение СтрШаблон("Неверное применение аннотации %1 на методе %2. Не заданы параметры",
				ИмяАннотацииПараметры,
				ИмяМетода);
		КонецЕсли;
	
		Если ПараметрыАннотации.Количество() <> КоличествоПараметров Тогда
			ВызватьИсключение СтрШаблон("Неверное применение аннотации %1 на методе %2. Не совпадает число параметров в методе и в аннотации",
				ИмяАннотацииПараметры,
				ИмяМетода);
		КонецЕсли;

		ЗначенияПараметров = Новый Массив;
		Для Каждого Параметр Из ПараметрыАннотации Цикл
			Если Параметр.Имя <> Неопределено Тогда
				// Тут можно сделать что-то типа method-source, но не сегодня
				ВызватьИсключение СтрШаблон("Неверное применение аннотации %1 на методе %2. Ожидаются параметры-значения, без имен",
					ИмяАннотацииПараметры,
					ИмяМетода);
			КонецЕсли;

			ЗначенияПараметров.Добавить(Параметр.Значение);
		КонецЦикла;

		Случай = Новый Структура("ИмяТеста,Параметры,Представление", 
			ИмяМетода,
			ЗначенияПараметров,
			СтрШаблон("%1(%2)", ИмяМетода, СтрСоединить(ЗначенияПараметров, ","))
		);
		ТестовыеСлучаи.Добавить(Случай);
	КонецЦикла;

	Возврат ТестовыеСлучаи;

КонецФункции

Процедура ДополнитьМассивПоАннотациям(ВхМассив, ТестовыйСлучай, ИмяАннотация)

	Если ТестовыйСлучай.Аннотации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Аннотация Из ТестовыйСлучай.Аннотации Цикл

		Если СтрНайти(Нрег(Аннотация.Имя), ИмяАннотация) > 0 Тогда
			ВхМассив.Добавить(ТестовыйСлучай.Имя);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьОписаниеСтекаВызовов(Знач ИнфоОшибки)

	Стек = ИнфоОшибки.ПолучитьСтекВызовов();
	ТекстСтека = "";
	Отступ = "                          ";
	ДлинаОтступа = СтрДлина(Отступ);
	Сч = 0;
	Для Каждого Кадр Из Стек Цикл
		Если Сч > ДлинаОтступа Тогда
			Сч = 1;
		КонецЕсли;

		ТекстСтека = ТекстСтека + Символы.ПС
		+ Лев(Отступ, Сч) + СтрШаблон("-> %1 (%2), %3", Кадр.Метод, Кадр.НомерСтроки, Кадр.ИмяМодуля);
		Сч = Сч + 2;
	КонецЦикла;

	Возврат ТекстСтека;

КонецФункции

Функция ВывестиОшибкуВыполненияТеста(СостояниеВыполнения, ПредставлениеОшибки, ОписаниеТеста, ТекстОшибки, ИнфоОшибки)
	ИмяМетода = ?(ЗначениеЗаполнено(ОписаниеТеста.Представление), ОписаниеТеста.Представление, ОписаниеТеста.ИмяМетода);

	сообщение = ?(ПредставлениеОшибки = "", "", ПредставлениеОшибки + Символы.ПС) +
		"Тест: <" + ИмяМетода + ">"  + Символы.ПС +
		"Файл: <" + ОписаниеТеста.ПолноеИмя + "> " + Символы.ПС +
		"Сообщение: " + ТекстОшибки;

	Если СостояниеВыполнения = ЗначенияСостоянияТестов.НеРеализован Тогда
		ВывестиПредупреждение(сообщение);
	Иначе
		ВывестиОшибку(сообщение);
	КонецЕсли;

	СтруктураОшибки = Новый Структура();

	СтруктураОшибки.Вставить("ИмяТестовогоНабора", ИмяМетода);

	стИнфоОшибки = Новый Структура("СостояниеВыполнения,ИмяМодуля,ИсходнаяСтрока,НомерСтроки,Описание");
	Если ИнфоОшибки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(стИнфоОшибки, ИнфоОшибки);
	КонецЕсли;
	стИнфоОшибки.Вставить("Причина",  Неопределено);

	стИнфоОшибкиЦикл = стИнфоОшибки;
	Если ИнфоОшибки <> Неопределено Тогда
		ИнфоОшибки = ИнфоОшибки.Причина;
	КонецЕсли;
	Пока ИнфоОшибки <> Неопределено Цикл
		стИнфоОшибкиЦикл.Причина = Новый Структура("ИмяМодуля,ИсходнаяСтрока,НомерСтроки,Описание");
		стИнфоОшибкиЦикл = стИнфоОшибкиЦикл.Причина;
		ЗаполнитьЗначенияСвойств(стИнфоОшибкиЦикл, ИнфоОшибки);
		стИнфоОшибкиЦикл.Вставить("Причина",  Неопределено);

		ИнфоОшибки = ИнфоОшибки.Причина;
	КонецЦикла;

	ИмяТестовогоСлучаяДляОписанияОшибки = ИмяМетода;

	СтруктураОшибки.Вставить("ИмяТестовогоСлучая", ИмяТестовогоСлучаяДляОписанияОшибки);
	СтруктураОшибки.Вставить("СостояниеВыполнения",  СостояниеВыполнения);

	СтруктураОшибки.Вставить("Описание",              ТекстОшибки);
	СтруктураОшибки.Вставить("ИнфоОшибки",            стИнфоОшибки);
	СтруктураОшибки.Вставить("ПолныйПуть",            ОписаниеТеста.ПолноеИмя);

	Если СостояниеВыполнения = ЗначенияСостоянияТестов.Сломался Тогда
		НаборОшибок.Вставить(ОписаниеТеста, СтруктураОшибки);
	Иначе
		НаборНереализованныхТестов.Вставить(ОписаниеТеста, СтруктураОшибки);
	КонецЕсли;

	Возврат СостояниеВыполнения;

КонецФункции

Функция ВыполнитьПередТестами(ОписаниеТеста)

	Возврат ВыполнитьПоАннотации(ОписаниеТеста, "инициализация", "ПередЗапускомТестов");

КонецФункции

Функция ВыполнитьПослеТестов(ОписаниеТеста)

	Возврат ВыполнитьПоАннотации(ОписаниеТеста, "завершение", "ПослеЗапускаТестов");

КонецФункции

Функция ВыполнитьПередТестом(ОписаниеТеста)

	Возврат ВыполнитьПоАннотации(ОписаниеТеста, "перед", "ПередЗапускомТеста");

КонецФункции

Функция ВыполнитьПослеТеста(ОписаниеТеста)

	Возврат ВыполнитьПоАннотации(ОписаниеТеста, "после", "ПослеЗапускаТеста");

КонецФункции

Функция СписокМетодовПоАннотации(ТестОбъект, СтрокаАннотации, ДополнительныйШаг)

	Методы = НайтиАннотированныеМетоды(ТестОбъект, СтрокаАннотации);
	Если Методы = Неопределено Тогда
		Методы = Новый Массив;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДополнительныйШаг) Тогда
		Методы.Добавить(ДополнительныйШаг);
	КонецЕсли;

	Возврат Методы;

КонецФункции

Функция ПолучитьМетодыЖизненногоЦикла(Знач ТестОбъект) Экспорт

	Возврат Новый Структура(
		"BeforeAll,BeforeEach,AfterEach,AfterAll",
		СписокМетодовПоАннотации(ТестОбъект, "инициализация", "ПередЗапускомТестов"),
		СписокМетодовПоАннотации(ТестОбъект, "перед", "ПередЗапускомТеста"),
		СписокМетодовПоАннотации(ТестОбъект, "после", "ПослеЗапускаТеста"),
		СписокМетодовПоАннотации(ТестОбъект, "завершение", "ПослеЗапускаТестов")
	);

КонецФункции

Функция ВыполнитьПроцедуруТестовогоСлучая(ИмяМетода, ТестОбъект, ОписаниеТеста)
	Успешно = Ложь;

	Если Не Рефлектор.МетодСуществует(ТестОбъект, ИмяМетода) Тогда
		Возврат Истина;
	КонецЕсли;

	Попытка
		НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Рефлектор.ВызватьМетод(ТестОбъект, ИмяМетода);
		ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;
		Успешно = Истина;
	Исключение
		ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ОписаниеОшибки();

		ВывестиОшибкуВыполненияТеста(
			ЗначенияСостоянияТестов.Сломался,
			"Упал метод " + ИмяМетода,
			ОписаниеТеста,
			ТекстОшибки,
			ИнфоОшибки)
		;

	КонецПопытки;

	Если ОписаниеТеста.Свойство("ВремяВыполнения") Тогда
		ОписаниеТеста.ВремяВыполнения = ОписаниеТеста.ВремяВыполнения + ВремяВыполнения;
	Иначе
		ОписаниеТеста.Вставить("ВремяВыполнения", ВремяВыполнения);
	КонецЕсли;

	Возврат Успешно;
КонецФункции

Функция ВывестиОшибку(Ошибка)

	НужныйТекстОшибки = Ошибка;

	Сообщить("ОШИБКА: " + НужныйТекстОшибки, СтатусСообщения.Важное);

	Возврат НужныйТекстОшибки;
КонецФункции

Функция ВывестиПредупреждение(Ошибка) Экспорт

	НужныйТекстОшибки = Ошибка;

	Сообщить("ПРЕДУПРЕЖДЕНИЕ: " + НужныйТекстОшибки, СтатусСообщения.Внимание);

	Возврат НужныйТекстОшибки;
КонецФункции

/////////////////////////////////////////////
ЗначенияСостоянияТестов();
Рефлектор = Новый Рефлектор();