Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ОбойтиКоллекцию");
	
	ТекКаталог = ТекущийСценарий().Каталог;
        
    ПодключитьСценарий(ОбъединитьПути(ТекКаталог, "iterator.os"), "ИтераторКоллекции");
    ПодключитьСценарий(ОбъединитьПути(ТекКаталог, "collection.os"), "Коллекция");
	
	Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_ОбойтиКоллекцию() Экспорт
    Коллекция = Новый Коллекция;
    
    Индекс = 1;
    Для Каждого Элемент Из Коллекция цикл
        юТест.ПроверитьРавенство(Индекс, Элемент);
        Индекс = Индекс + 1;
    КонецЦикла;
    
    юТест.ПроверитьРавенство(10, Индекс);
КонецПроцедуры