Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКонструкторПоУмолчанию");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКонструкторСЗаголовкамиИПолезнойНагрузкой");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСКлючом");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаБезКлюча");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьОшибкуПриПодписиБезКлюча");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСОднимПолучателем");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаСДвумяПолучателями");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьГенерациюТокенаCРазличнымиТипамиЗначений");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьКонструкторПоУмолчанию() Экспорт

	Токен = Новый ТокенДоступа();
	
	юТест.ПроверитьРавенство(Токен.ВремяЖизни, 0);
	юТест.ПроверитьРавенство(Токен.ВремяСоздания, 0);
	юТест.ПроверитьРавенство(Токен.Идентификатор, "");
	юТест.ПроверитьРавенство(Токен.КлючСопоставленияПользователя, "");
	юТест.ПроверитьРавенство(Токен.Эмитент, "");
	юТест.ПроверитьРавенство(Токен.Заголовки.Количество(), 0);
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка.Количество(), 0);
	юТест.ПроверитьРавенство(Токен.Получатели.Количество(), 0);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКонструкторСЗаголовкамиИПолезнойНагрузкой() Экспорт

    Заголовки = Новый Соответствие;
	Заголовки["typ"] = "JWT";
	Заголовки["any"] = "some";
	
	ПолезнаяНагрузка = Новый Соответствие;
	ПолезнаяНагрузка["sub"] = "user123";
	ПолезнаяНагрузка["name"] = "Test User";
	
	Токен = Новый ТокенДоступа(Заголовки, ПолезнаяНагрузка);
	
	юТест.ПроверитьРавенство(Токен.Заголовки.Количество(), 2);
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка.Количество(), 2);
	юТест.ПроверитьРавенство(Токен.Заголовки["typ"], "JWT");
	юТест.ПроверитьРавенство(Токен.Заголовки["any"], "some");
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка["sub"], "user123");
	юТест.ПроверитьРавенство(Токен.ПолезнаяНагрузка["name"], "Test User");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСКлючом() Экспорт

	ПриватныйКлючECDSA = ПриватныйКлючECDSA();	
	ПриватныйКлючRSA = ПриватныйКлючRSA();

	ТестовыеСлучаи = Новый Соответствие();
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES256, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES384, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.ES512, ПриватныйКлючECDSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.HS512, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.PS512, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS256, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS384, ПриватныйКлючRSA);
	ТестовыеСлучаи.Вставить(АлгоритмПодписиТокенаДоступа.RS512, ПриватныйКлючRSA);

	Токен = ТестовыйТокенДоступа();
	ОжидаемыеЧастиТокена = ОжидаемыеЧастиТестовогоТокена();
	
	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл
		Алгоритм = ТестовыйСлучай.Ключ;
		ПриватныйКлюч = ТестовыйСлучай.Значение;

		Токен.Подписать(Алгоритм, ПриватныйКлюч);

		РазобранныйТокен = РазобратьJWT(Токен);

		юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, СтрШаблон(ОжидаемыеЧастиТокена.Заголовки, Алгоритм), "Заголовки для " + Алгоритм);
		юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемыеЧастиТокена.ПолезнаяНагрузка, "Полезная нагрузка для " + Алгоритм);
		юТест.ПроверитьЗаполненность(РазобранныйТокен.Сигнатура, "Сигнатура для " + Алгоритм);
	КонецЦикла;	

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаБезКлюча() Экспорт

	Токен = ТестовыйТокенДоступа();
	Токен.Подписать(АлгоритмПодписиТокенаДоступа.Нет);

	РазобранныйТокен = РазобратьJWT(Токен);
	ОжидаемыеЧастиТокена = ОжидаемыеЧастиТестовогоТокена();
	
	юТест.ПроверитьРавенство(РазобранныйТокен.Заголовки, СтрШаблон(ОжидаемыеЧастиТокена.Заголовки, "none"), "Заголовки");
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемыеЧастиТокена.ПолезнаяНагрузка, "Полезная нагрузка");
	юТест.ПроверитьНеЗаполненность(РазобранныйТокен.Сигнатура, "Сигнатура");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСОднимПолучателем() Экспорт

	Токен = Новый ТокенДоступа();
	Токен.Получатели.Добавить("mobile.app");

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""aud"":""mobile.app""}");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаСДвумяПолучателями() Экспорт

	Токен = Новый ТокенДоступа();
	Токен.Получатели.Добавить("api.example.com");
	Токен.Получатели.Добавить("mobile.app");

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, "{""aud"":[""api.example.com"",""mobile.app""]}");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьГенерациюТокенаCРазличнымиТипамиЗначений() Экспорт

	ОжидаемоеЗначение = "{""Число"":1000.10,""Булево"":true,""Дата"":""2001-01-01T17:20:20.0000000Z"",""Нуль"":"""",""Неопределено"":"""",""Массив"":[100,{""Ключ1"":""Значение1""},{""Ключ2"":""Значение2"",""Структура"":{""Ключ1"":""Значение1""}}],""Структура"":{""Ключ1"":""Значение1""},""Соответствие"":{""Ключ2"":""Значение2"",""Структура"":{""Ключ1"":""Значение1""}}}";
	
	Структура = Новый Структура("Ключ1", "Значение1");

	Соответствие = Новый Соответствие();
	Соответствие.Вставить("Ключ2", "Значение2");
	Соответствие.Вставить("Структура", Структура);

	Массив = Новый Массив();
	Массив.Добавить(100);
	Массив.Добавить(Структура);
	Массив.Добавить(Соответствие);

	Токен = Новый ТокенДоступа();
	Токен.ПолезнаяНагрузка.Вставить("Число", 1000.10);
	Токен.ПолезнаяНагрузка.Вставить("Булево", Истина);
	Токен.ПолезнаяНагрузка.Вставить("Дата", Дата(2001, 1, 1, 20, 20, 20));
	Токен.ПолезнаяНагрузка.Вставить("Нуль", null);
	Токен.ПолезнаяНагрузка.Вставить("Неопределено", Неопределено);
	Токен.ПолезнаяНагрузка.Вставить("Массив", Массив);
	Токен.ПолезнаяНагрузка.Вставить("Структура", Структура);
	Токен.ПолезнаяНагрузка.Вставить("Соответствие", Соответствие);

	РазобранныйТокен = РазобратьJWT(Токен);
	
	юТест.ПроверитьРавенство(РазобранныйТокен.ПолезнаяНагрузка, ОжидаемоеЗначение);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОшибкуПриПодписиБезКлюча() Экспорт
	юТест.ПроверитьКодСОшибкой(
		"Токен = Новый ТокенДоступа();
		|Токен.Подписать(АлгоритмПодписиТокенаДоступа.ES256)", 
		"Ключ подписи не может быть пустым для выбранного алгоритма", 
		"Должна была возникнуть ошибка при подписи без ключа"
	);
КонецПроцедуры

Функция ТестовыйТокенДоступа()

	Токен = Новый ТокенДоступа();
	Токен.ВремяЖизни = 3600;
	Токен.ВремяСоздания = 1640995200; // 2022-01-01 00:00:00 UTC
	Токен.Идентификатор = "unique-token-id";
	Токен.КлючСопоставленияПользователя = "john.doe@example.com";
	Токен.Эмитент = "https://auth.example.com";
	
	Токен.Заголовки["typ"] = "JWT";
	
	Токен.ПолезнаяНагрузка["role"] = "admin";
	Токен.ПолезнаяНагрузка["permissions"] = "read,write,delete";
	
	Токен.Получатели.Добавить("api.example.com");
	Токен.Получатели.Добавить("mobile.app");

	Возврат Токен;

КонецФункции

Функция ОжидаемыеЧастиТестовогоТокена()

	ОжидаемыеЗаголовки = "{""alg"":""%1"",""typ"":""JWT""}";
	ОжидаемаяПолезнаяНагрузка = "{""iss"":""https://auth.example.com"",""iat"":1640995200,""nbf"":1640995200,""exp"":1640998800,""jti"":""unique-token-id"",""sub"":""john.doe@example.com"",""aud"":[""api.example.com"",""mobile.app""],""role"":""admin"",""permissions"":""read,write,delete""}";

	Возврат Новый Структура("Заголовки, ПолезнаяНагрузка", ОжидаемыеЗаголовки, ОжидаемаяПолезнаяНагрузка);

КонецФункции

Функция РазобратьJWT(Токен)
	
	Части = СтрРазделить(Токен, ".");
	юТест.ПроверитьРавенство(Части.Количество(), 3, "Количество частей");
	
	Результат = Новый Структура("Заголовки, ПолезнаяНагрузка, Сигнатура");
	Результат.Заголовки = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(НормализоватьBase64(Части[0])));
	Результат.ПолезнаяНагрузка = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(НормализоватьBase64(Части[1])));
	Результат.Сигнатура = Части[2];

	Возврат Результат;

КонецФункции

Функция НормализоватьBase64(Знач Значение)
	
	Значение = СтрЗаменить(Значение, "-", "+");
	Значение = СтрЗаменить(Значение, "_", "/");
	
	Длина = СтрДлина(Значение);
	Остаток = Длина % 4;
	Паддинг = "";

	Если Остаток = 2 Тогда
		Паддинг = "==";
	ИначеЕсли Остаток = 3 Тогда
		Паддинг = "=";	
	КонецЕсли;

	Возврат Значение + Паддинг;
КонецФункции

// 2048 bits, PKCS#8
Функция ПриватныйКлючRSA() Экспорт
	Возврат "
	|-----BEGIN PRIVATE KEY-----
	|MIIEvQIBADANBgkqhkiG9w0BAQEFAASCBKcwggSjAgEAAoIBAQCT4Ws/kRkM92gs
	|rljP85+ZaBoE/aJa5yBoWOJI5notYGDwAU66WofBunLIlUNn/YuETvs12mCCClBX
	|ODurlwi+wLs5HyXf1gqNzVP4JN5QFUpqd2RQrUZLqBoONjZAok9P3oAw4JuJDnBm
	|JODFLQjbCUOvorxR33iCPDfflvSa8kIxkQ3hA6zB7vu0j5s8HGCXczRI0pSblAH3
	|GEPSPp8D4IBmVKi90lQjCVVlCMY/hVkecqjc2hhfsh2cF/R2Q3NptNSLtw+lEMOU
	|uUQtgVnULhTYDRaRJ9HripxQvQ2Se/BnozFVPfKokouh6f0ti9b4vWSDN3EjuMEu
	|wf+ttUPhAgMBAAECggEAZRT3lzraMbfHmIsQIAz6MgUri+/HE3Xa/BiNjKEmMHAp
	|ssRiCRWqqCyHGz6UFbgErsrCAhykTR85rXS9rNuPWbwp/bCh1e/bxPPuCrdA0uLK
	|vB2iD1dxrnNYZBCAYwvPRNvlKgPNrRCWmetpTL4syHP7tUl6ikhDelopIwdvaZ1W
	|cQeDq6QqkzOcJFdXHIHxZ2qbnjJoinyfPzmA98Ijdi8ynjIqKxj0f+0r567nxe/q
	|Z4FwbPi7bRSmfMsTCM0SagwMuQoqvB6iktrZEYYUJmcN7V/gjN1viqVkjudk/CC5
	|RgMBp7yhrt3SP2oErAaAlTWldRVJ8qquJSpXkBhTxQKBgQDM8S9WIZgl2HwWsK9c
	|C2JTC0peB8W1B3rM5IYvrCN0uB/P/KZ/Igwkla3wsOhy2SDPBYqzP/4OPzz4atOL
	|PFDdBGrIQgseSajPp7nuD91IjI9KFXUT1EUBbKhWmATZwQqCOlHtSoi4zl+dJWgr
	|dVzQxykh3ME85mIU3cxWNxk+swKBgQC4uPSsE9aJ5JK5LCfpcsVYeeatko72rA2t
	|N/aPActklWwkR/tvJ43jG5RwKwbY4N2V6a5Tz5xQIe550vvBd56ku6tmEJDLL+jc
	|QLh5lajV3JJq+tazdyZkztaSwOucuZve9R+eYAPM3uqYO8gAJSrJQQwlAoJkrWk6
	|zoISqvk9GwKBgFJQsVWkCqtwx26JqvWKcQSv7T/VWVi711wCkc8GEfuolMaCURGR
	|SFVNdV7Of57ZjS75p9sVYeKxDbktlyg+orATPRyQQkz5Av/c+3YeEyA3rLnx4mOD
	|h+/ph7e4OYKI4cKq0AtCO6YW5hqFUtDZw9zrkZ7TPx5J3q1I5PDgEpi3AoGAYokO
	|wwfmBjJubeZ299loGdUUzvwB1OVcek0C8a/kXigywnu/TMDNuBrLKLZa9a+lo8U+
	|X6i8WiZvfn6kGsSDVJ5jRJOLmUdaMLs5bGn/4OzDEdvyUVM6oMWQwkG0rSp5Ugpx
	|rlrLTCqQ+1nQSvuIgkh3gPqAsdGq81qbGfgn8YcCgYEAjodWERs0eCSMNGIshss4
	|/GN50lbOiI0+ke99160kT/hpep1WCEpXBfCeXLBamcG36Uk8c34DrxJ2Uj8LC895
	|/tB4HFgbQ52VxQdQCNGcs9hOxPuLlXlSdKNuplvfAkg2JhMrES7KtAxOBAcK77kx
	|JzEREQEFN8CmwDvSpw8Mz9k=
	|-----END PRIVATE KEY-----";
КонецФункции

// secp256r1
Функция ПриватныйКлючECDSA()
	Возврат "
	|-----BEGIN PRIVATE KEY-----
	|MIGHAgEAMBMGByqGSM49AgEGCCqGSM49AwEHBG0wawIBAQQgZYdbovRCqelX1FPY
	|EE8VAbDJ/cT99z8r8ZisRgftCt6hRANCAASFDFrXFeOV0rYTDuIDJHKUdwqc7Z3z
	|gCxaeTCRJ+KBCw7AsGearOWLn67Y424YAx73wr3T9BIrQ3yGgPXZmzUR
	|-----END PRIVATE KEY-----";
КонецФункции