Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКлючНеопределеноВСоответствии");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьКлючНеопределеноВСоответствии() Экспорт
    
    Соотв = Новый Соответствие;
    Соотв[Неопределено] = Истина;
    юТест.ПроверитьРавенство(1, Соотв.Количество());
    юТест.ПроверитьРавенство(Истина, Соотв[Неопределено]);
    
КонецПроцедуры