#stack

///////////////////////////////////////////////////////////////////////
// Тест класса Действие/Action
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ВыполнитьДействиеОбъектаТеста_Стэковый");
	ВсеТесты.Добавить("ТестДолжен_ВыполнитьДействиеОбъектаТеста_Родной");
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКоличествоПараметров_Стэковый");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьКоличествоПараметров_Родной");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ВыполнитьДействиеОбъектаТеста(Знач ТипДелегата)
	
	Делегат = ТестовыйДелегат(ТипДелегата);
	Делегат.Выполнить("123", 456);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличествоПараметров(Знач ТипДелегата)
	
	Делегат = ТестовыйДелегат(ТипДелегата);

	ЕстьОшибка = Ложь;
	Попытка
		Делегат.Выполнить("123");
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;

	юТест.ПроверитьИстину(ЕстьОшибка, "Вызов с недостаточным количеством параметров должен бросать исключение");

	ЕстьОшибка = Ложь;
	Попытка
		Делегат.Выполнить("123", 456, '00010101');
	Исключение
		ЕстьОшибка = Истина;
	КонецПопытки;

	юТест.ПроверитьИстину(ЕстьОшибка, "Вызов с избыточным количеством параметров должен бросать исключение");

КонецПроцедуры

Процедура ТестДолжен_ВыполнитьДействиеОбъектаТеста_Стэковый() Экспорт
	ТестДолжен_ВыполнитьДействиеОбъектаТеста("#stack");
КонецПроцедуры

Процедура ТестДолжен_ВыполнитьДействиеОбъектаТеста_Родной() Экспорт
	ТестДолжен_ВыполнитьДействиеОбъектаТеста("#native");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличествоПараметров_Родной() Экспорт
	ТестДолжен_ПроверитьКоличествоПараметров("#native")
КонецПроцедуры

Процедура ТестДолжен_ПроверитьКоличествоПараметров_Стэковый() Экспорт
	ТестДолжен_ПроверитьКоличествоПараметров("#stack")
КонецПроцедуры

Функция ТестовыйДелегат(Знач ТипДелегата)
	
	ПутьКСкрипту = юТест.ИмяВременногоФайла("os");
	ИмяКласса = "Класс" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");

	ТекстКласса = ТипДелегата +
		"
		|
		|Процедура Тест(Парам, Парам2) Экспорт
		|	Сообщить(Парам + Парам2);
		|КонецПроцедуры";

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКСкрипту);
	ЗаписьТекста.Записать(ТекстКласса);
	ЗаписьТекста.Закрыть();

	ПодключитьСценарий(ПутьКСкрипту, ИмяКласса);

	Класс = Новый(ИмяКласса);
	
	Делегат = Новый Действие(Класс, "Тест");
	
	Возврат Делегат;

КонецФункции
