Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьПередачуВКонтекстПриведенногоКСтрокеЗначения");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьПредставлениеОбычногоКласса");
	юТест = ЮнитТестирование;
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьПередачуВКонтекстПриведенногоКСтрокеЗначения() Экспорт
    ТекстКласса =
    	"Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка)
    	|	СтандартнаяОбработка = Ложь;
    	|	Представление = ""Представление"";
    	|КонецПроцедуры";
    	
    КлассИзСтроки = ЗагрузитьСценарийИзСтроки(ТекстКласса);
    
    // see https://github.com/EvilBeaver/OneScript/issues/1530
    // СтрНайти это подключаемый контекст, который вызывается маршаллером.
    юТест.ПроверитьРавенство(1, СтрНайти(КлассИзСтроки, "Представление"), Строка(КлассИзСтроки));
    
    // СтрЗаменить это опкод ВМ, который не обрабатывается маршаллером
    Замена = СтрЗаменить(КлассИзСтроки, "Пред", "На");
    юТест.ПроверитьРавенство("Наставление", Замена);
    
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПредставлениеОбычногоКласса() Экспорт
    ТекстКласса = "Перем А;";
    КлассИзСтроки = ЗагрузитьСценарийИзСтроки(ТекстКласса);
    
    юТест.ПроверитьРавенство("Сценарий", Строка(КлассИзСтроки));
    юТест.ПроверитьРавенство("Сценарий", СтрЗаменить(КлассИзСтроки, "%%%", ""));
    
КонецПроцедуры