Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьХешированниеДанныхИзПотокаВПамяти");
	
	Возврат ВсеТесты;
	
КонецФункции

Функция ТестДолжен_ПроверитьХешированниеДанныхИзПотокаВПамяти() Экспорт
	
	БДД = ПолучитьБуферДвоичныхДанныхИзHexСтроки("313233");
	Поток = новый ПотокВПамяти();
	Структура = Новый Структура("Поток", Поток);
	Поток.Записать(БДД, 0, 3);
	Поток.Перейти(0,ПозицияВПотоке.Начало);
	ХД = новый ХешированиеДанных(ХешФункция.MD5);
	ХД.Добавить(Поток);
	юТест.ПроверитьРавенство(Строка(ХД.ХешСумма),
							"20 2C B9 62 AC 59 07 5B 96 4B 07 15 2D 23 4B 70",
							"Не получен ожидаемый hash - 20 2C B9 62 AC 59 07 5B 96 4B 07 15 2D 23 4B 70" );

КонецФункции