#Использовать asserts

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ВернутьДоступноеМесто");
	СписокТестов.Добавить("Тест_Должен_ВернутьИмяФС");
	СписокТестов.Добавить("Тест_Должен_ВернутьТипДиска");
	СписокТестов.Добавить("Тест_Должен_ВернутьГотов");
	СписокТестов.Добавить("Тест_Должен_ВернутьИмя");
	СписокТестов.Добавить("Тест_Должен_ВернутьКорневойКаталог");
	СписокТестов.Добавить("Тест_Должен_ВернутьОбщийОбъемСвободногоМеста");
	СписокТестов.Добавить("Тест_Должен_ВернутьРазмерДиска");
	СписокТестов.Добавить("Тест_Должен_ВернутьМеткаТома");
	
	СписокТестов.Добавить("Тест_Должен_ВывестиЗначения");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ВернутьДоступноеМесто() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.Доступно).Больше(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьИмяФС() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.ИмяФС).ЭтоНе().Равно("");
КонецПроцедуры

Процедура Тест_Должен_ВернутьТипДиска() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.ТипДиска).ЭтоНе().Равно("");
КонецПроцедуры

Процедура Тест_Должен_ВернутьГотов() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.Готов).ЭтоИстина();
КонецПроцедуры

Процедура Тест_Должен_ВернутьИмя() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.Имя).ЭтоНе().Равно("");
КонецПроцедуры

Процедура Тест_Должен_ВернутьКорневойКаталог() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.КорневойКаталог.Путь).ЭтоНе().Равно("");
КонецПроцедуры

Процедура Тест_Должен_ВернутьОбщийОбъемСвободногоМеста() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.ОбщийОбъемСвободногоМеста).Больше(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьРазмерДиска() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.РазмерДиска).Больше(0);
КонецПроцедуры

Процедура Тест_Должен_ВернутьМеткаТома() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Ожидаем.Что(ИнформацияОДиске.МеткаТома).Существует();
КонецПроцедуры

Процедура Тест_Должен_ВывестиЗначения() Экспорт
	ИнформацияОДиске = Новый ИнформацияОДиске(Новый СистемнаяИнформация().ИменаЛогическихДисков[0]);
	Сообщить("Доступно: " + ИнформацияОДиске.Доступно);
	Сообщить("ИмяФС: " + ИнформацияОДиске.ИмяФС);
	Сообщить("ТипДиска: " + ИнформацияОДиске.ТипДиска);
	Сообщить("Готов: " + ИнформацияОДиске.Готов);
	Сообщить("Имя: " + ИнформацияОДиске.Имя);
	Сообщить("КорневойКаталог.Путь: " + ИнформацияОДиске.КорневойКаталог.Путь);
	Сообщить("ОбщийОбъемСвободногоМеста: " + ИнформацияОДиске.ОбщийОбъемСвободногоМеста);
	Сообщить("РазмерДиска: " + ИнформацияОДиске.РазмерДиска);
	Сообщить("МеткаТома: " + ИнформацияОДиске.МеткаТома);
КонецПроцедуры