Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	Си = Новый СистемнаяИнформация;
	
	ВсеТесты = Новый Массив;
	
	#Если Windows и NETFRAMEWORK Тогда
		ВсеТесты.Добавить("ТестДолженПроверитьЧтоФайлБезБОМСчитываетсяКакANSI");
	#Иначе
		ВсеТесты.Добавить("ТестДолженПроверитьЧтоФайлБезБОМСчитываетсяКакUTF");
	#КонецЕсли
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ПослеЗапускаТеста() Экспорт
	юТест.УдалитьВременныеФайлы();
КонецПроцедуры

Функция ЗаписатьФайлБезБОМ(Кодировка)
	Файл = юТест.ИмяВременногоФайла();
	
	Запись = Новый ЗаписьТекста(Файл, Кодировка);
	Запись.Записать("Привет");
	Запись.Закрыть();
	
	Возврат Файл;
КонецФункции

Процедура ТестДолженПроверитьЧтоФайлБезБОМСчитываетсяКакANSI() Экспорт
	
	Файл = ЗаписатьФайлБезБОМ(КодировкаТекста.ANSI);
	
	Чтение = Новый ЧтениеТекста(Файл);
	Текст = Чтение.Прочитать();
	Чтение.Закрыть();
	
	юТест.ПроверитьРавенство("Привет", Текст);
	
КонецПроцедуры

Процедура ТестДолженПроверитьЧтоФайлБезБОМСчитываетсяКакUTF() Экспорт

	Файл = ЗаписатьФайлБезБОМ(КодировкаТекста.UTF8NoBOM);
	
	Чтение = Новый ЧтениеТекста(Файл);
	Текст = Чтение.Прочитать();
	Чтение.Закрыть();
	
	юТест.ПроверитьРавенство("Привет", Текст);

КонецПроцедуры
