
Перем юТест;
Перем СостояниеВызова;
Перем ПараметрыВызова;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьПодпискуНаСобытие");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьОтпискуОтСобытия");
	
	Возврат ВсеТесты;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	СостояниеВызова = Ложь;
	ПараметрыВызова = Неопределено;
КонецПроцедуры

Процедура СгенерироватьСобытие(Знач ИмяСобытия, Знач Параметры) Экспорт
	ВызватьСобытие(ИмяСобытия, Параметры);
КонецПроцедуры

Процедура ОбработчикСобытия(Параметр1, Параметр2)
	
	СостояниеВызова = Истина;
	ПараметрыВызова = Новый Структура("Параметр1, Параметр2", Параметр1, Параметр2);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПодпискуНаСобытие() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("П1");
	МассивПараметров.Добавить("П2");

	СгенерироватьСобытие("МоеСобытие", МассивПараметров);

	Источник = Новый ТестСобытий;

	ДобавитьОбработчик Источник.МоеСобытие, ЭтотОбъект.ОбработчикСобытия;

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("П1");
	МассивПараметров.Добавить("П2");

	СгенерироватьСобытие("МоеСобытие", МассивПараметров);
	юТест.ПроверитьИстину(СостояниеВызова);
	юТест.ПроверитьРавенство("П1", ПараметрыВызова.Параметр1);
	юТест.ПроверитьРавенство("П2", ПараметрыВызова.Параметр2);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьОтпискуОтСобытия() Экспорт
	
	Источник = Новый ТестСобытий;

	ДобавитьОбработчик Источник.МоеСобытие, ЭтотОбъект.ОбработчикСобытия;

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("П1");
	МассивПараметров.Добавить("П2");

	СгенерироватьСобытие("МоеСобытие", МассивПараметров);
	юТест.ПроверитьИстину(СостояниеВызова);

	УдалитьОбработчик Источник.МоеСобытие, ЭтотОбъект.ОбработчикСобытия;

	СостояниеВызова = Ложь;
	СгенерироватьСобытие("МоеСобытие", МассивПараметров);
	юТест.ПроверитьЛожь(СостояниеВызова);

КонецПроцедуры

ПодключитьСценарий(ТекущийСценарий().Источник, "ТестСобытий");