Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВозведениеВСтепень");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьВозведениеВСтепень() Экспорт

	юТест.ПроверитьРавенство(Pow(2,2), 4);
	юТест.ПроверитьРавенство(Pow(2,1), 2);
	юТест.ПроверитьРавенство(Pow(2,0), 1);
	юТест.ПроверитьРавенство(Pow(2,-1), 0.5);
	юТест.ПроверитьРавенство(Pow(2,0.5), 1.4142135623731);
	юТест.ПроверитьРавенство(Pow(0.00065536,-0.125), 2.5);
	юТест.ПроверитьРавенство(Pow(0,2), 0);

	юТест.ПроверитьРавенство(Pow(2,50), 1125899906842624);
	юТест.ПроверитьРавенство(Pow(2,50.001), 1126680591722150);
	юТест.ПроверитьРавенство(Pow(2.001,50), 1154394986095681.3754617408527);
	юТест.ПроверитьРавенство(Pow(2,95), 39614081257132168796771975168);
	юТест.ПроверитьРавенство(Pow(2,95.9999999999999), 79228162514258900000000000000);

	юТест.ПроверитьРавенство(Pow(3,32), 1853020188851841);
	юТест.ПроверитьРавенство(Pow(5,22), 2384185791015625);
	юТест.ПроверитьРавенство(Pow(7,18), 1628413597910449);
	
КонецПроцедуры

