Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ВыполнитьРешетоЭратосфена");
	
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ВыполнитьРешетоЭратосфена() Экспорт
	
	Фрагмент = Новый СкомпилированныйФрагмент();

	Массив = Новый Массив;
	Н = 500;

	Алгоритм = "времяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	|Для индекс = 2 По Н Цикл
	|	Если Массив[индекс] Тогда
	|		квадрат = индекс * индекс;
	|		Если квадрат <= Н Тогда
	|			м = квадрат;
	|			Пока м <= Н Цикл
	|				Массив[м] = Ложь;
	|				м = м + индекс;
	|			КонецЦикла;
	|		КонецЕсли;
	|	КонецЕсли;
	|КонецЦикла;
	|
	|времяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	|Возврат (времяОкончания - времяНачала)/1000";

	Для Сч = 0 По Н Цикл
		Если Сч < 2 Тогда
			Массив[Сч] = Ложь;
		Иначе
			Массив[Сч] = Истина;
		КонецЕсли
	КонецЦикла;

	Фрагмент.ФрагментКода = Алгоритм;
	Фрагмент.Параметры.Вставить("Н", Тип("Число"));
	Фрагмент.Параметры.Вставить("Массив", Тип("Массив"));
	
	Действие = Фрагмент.Скомпилировать();

	Время = Действие(Н, Массив);
	Сообщить(Время);

КонецПроцедуры