#native

Перем юТест;
Перем Лог;
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВызовМетода");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВызовАссерта");
		
	Возврат ВсеТесты;
	
КонецФункции

// Вызовется со стороны основного рантайма
Процедура ТестДолжен_ПроверитьВызовМетода() Экспорт
	// просто не должно упасть
	Сообщить("Вызвано со стороны testrunner")
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВызовАссерта() Экспорт
	// должно суметь вызвать основной рантайм (юТест.*)
	юТест.ПроверитьРавенство(1, 1);
	Сообщить("Выполнен вызов в сторону testrunner");
КонецПроцедуры
