Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_УбедитьсяЧтоВыводитсяВерсия");
	
	Возврат ВсеТесты;
КонецФункции

Функция ПутьОСкрипт()

	Возврат """" + ОбъединитьПути(КаталогПрограммы(), "oscript.exe") + """";

КонецФункции


Процедура ТестДолжен_УбедитьсяЧтоВыводитсяВерсия() Экспорт

	Перем Процесс;

	Процесс = СоздатьПроцесс(ПутьОСкрипт() + " -version", , Истина);
	Процесс.Запустить();
	Процесс.ОжидатьЗавершения();

	Для Сч = 1 По 100 Цикл
		// возникают ситуации, когда внутренние читатели процесса еще не сбросили данные в oscript
		// надо копать синхронизацию.
		Если Процесс.ПотокВывода.ЕстьДанные Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеВывода = Процесс.ПотокВывода.Прочитать();
	ДанныеВывода = СокрП(ДанныеВывода);

	СистемнаяИнформация = Новый СистемнаяИнформация;

	юТест.ПроверитьРавенство(ДанныеВывода, СистемнаяИнформация.Версия, "Версия вывода не совпадает с системной информацией!");

КонецПроцедуры


