Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_УбедитьсяЧтоВыводитсяВерсия");
	
	Возврат ВсеТесты;
КонецФункции

Функция ПутьОСкрипт()

	Возврат """" + ОбъединитьПути(КаталогПрограммы(), "oscript.exe") + """";

КонецФункции


Процедура ТестДолжен_УбедитьсяЧтоВыводитсяВерсия() Экспорт

	Перем Процесс;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;

	ПроверяемыеКлючи = Новый Массив;
	ПроверяемыеКлючи.Добавить("-version");
	ПроверяемыеКлючи.Добавить("-v");

	Для Каждого мПроверяемыйКлюч Из ПроверяемыеКлючи Цикл
		
		Процесс = СоздатьПроцесс(ПутьОСкрипт() + " " + мПроверяемыйКлюч, , Истина);
		Процесс.Запустить();
		Процесс.ОжидатьЗавершения();
		
		ДанныеВывода = Процесс.ПотокВывода.Прочитать();

		юТест.ПроверитьРавенство(ДанныеВывода, СистемнаяИнформация.Версия, "Версия вывода не совпадает с системной информацией!");

	КонецЦикла;

КонецПроцедуры


