Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	// TODO: @artbear, не знаю, как можно протестировать сервер.
	ВсеТесты.Добавить("ТестДолжен_СоздатьСокет");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_СоздатьСокет() Экспорт
	
	Сервер = Новый TCPСервер(1541);
	Сервер.Запустить();
	Сообщить("Жду соединения");
	Пока Истина Цикл
		
		Соединение = Сервер.ОжидатьСоединения();
		Сообщить("Есть соединение");
		Данные = Соединение.ПрочитатьСтроку("utf-8");
		Сообщить(Данные);
		// Данные = Соединение.ПрочитатьДвоичныеДанные();
		// Сообщить(Данные);
		Соединение.Закрыть();
		
		Прервать;
		
	КонецЦикла;
	
	Сервер.Остановить();
	
КонецПроцедуры
