Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_СоздатьСокет");
	ВсеТесты.Добавить("ТестДолжен_СоздатьСокет_СТаймаутом");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_СоздатьСокет() //Экспорт // TODO: @artbear, не знаю, как можно протестировать сервер. 
	
	Сервер = Новый TCPСервер(18414);
	Сервер.Запустить();
	Сообщить("Жду соединения");
	Пока Истина Цикл
		
		Соединение = Сервер.ОжидатьСоединения();
		Сообщить("Есть соединение");
		Данные = Соединение.ПрочитатьСтроку("utf-8");
		Сообщить(Данные);
		// Данные = Соединение.ПрочитатьДвоичныеДанные();
		// Сообщить(Данные);
		Соединение.Закрыть();
		
		Прервать;
		
	КонецЦикла;
	
	Сервер.Остановить();
	
КонецПроцедуры

Процедура ТестДолжен_СоздатьСокет_СТаймаутом() Экспорт
	
	Сервер = Новый TCPСервер(3541);
	Сервер.Запустить();
	Сообщить("Жду соединения");
	Пока Истина Цикл
		
		Соединение = Сервер.ОжидатьСоединения(1);
		юТест.ПроверитьРавенство(Неопределено, Соединение);
		Прервать;		
	КонецЦикла;
	
	Сервер.Остановить();
	
КонецПроцедуры
