Перем юТест;

Функция ПолучитьТекстИзФайла(ИмяФайла) Экспорт
	ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;
	ПутьКФайлу = ТекПуть + "fixtures\" +  ИмяФайла;
	ФайлОбмена = Новый Файл(ПутьКФайлу);
	Данные = "";
	Если ФайлОбмена.Существует() Тогда
		Текст = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
		Данные = Текст.Прочитать();
		Текст.Закрыть();
		ОсвободитьОбъект(Текст);
	КонецЕсли;
	возврат Данные;
КонецФункции

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ВернутьСтроку1");
	ВсеТесты.Добавить("ТестДолжен_ВернутьСтроку2");
	ВсеТесты.Добавить("ТестДолжен_ВернутьСтроку5");
	ВсеТесты.Добавить("ТестДолжен_ВернутьСтроку10");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ВернутьСтроку1() Экспорт

	Данные = ПолучитьТекстИзФайла("module.txt");
	Стр = СтрПолучитьСтроку(Данные, 1);

	юТест.ПроверитьРавенство("", Стр);
КонецПроцедуры

Процедура ТестДолжен_ВернутьСтроку2() Экспорт

	Данные = ПолучитьТекстИзФайла("module.txt");
	Стр = СтрПолучитьСтроку(Данные, 2);

	юТест.ПроверитьРавенство("Стр2", Стр);
КонецПроцедуры

Процедура ТестДолжен_ВернутьСтроку5() Экспорт

	Данные = ПолучитьТекстИзФайла("module.txt");
	Стр = СтрПолучитьСтроку(Данные, 5);

	юТест.ПроверитьРавенство("", Стр);
КонецПроцедуры

Процедура ТестДолжен_ВернутьСтроку10() Экспорт

	Данные = ПолучитьТекстИзФайла("module.txt");
	Стр = СтрПолучитьСтроку(Данные, 10);

	юТест.ПроверитьРавенство("Стр10", Стр);
КонецПроцедуры
