#Использовать "templateslib"

Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПолучитьМакетВидаФайл");
	ВсеТесты.Добавить("ТестДолжен_ПолучитьМакетВидаДвоичныеДанные");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВыбросИсключенияНаНеверномМакете");
	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПолучитьМакетВидаФайл() Экспорт
	юТест.ПодробныеОписанияОшибок(Истина);
	Путь = ПолучитьМакет("/templateslib/Data");
	юТест.ПроверитьРавенство(Тип("Строка"), ТипЗнч(Путь));
	
	ЧтениеТекста = Новый ЧтениеТекста(Путь);
	Строка = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	юТест.ПроверитьРавенство("ПРИВЕТ, Я МАКЕТ", Строка);

КонецПроцедуры

Процедура ТестДолжен_ПолучитьМакетВидаДвоичныеДанные() Экспорт
	юТест.ПодробныеОписанияОшибок(Истина);
	ДД = ПолучитьМакет("/templateslib/DataBin");
	юТест.ПроверитьРавенство(Тип("ДвоичныеДанные"), ТипЗнч(ДД));
	
	ЧтениеДанных = Новый ЧтениеДанных(ДД);
	Строка = ЧтениеДанных.ПрочитатьСтроку();
	
	юТест.ПроверитьРавенство("ПРИВЕТ, Я МАКЕТ", Строка);

КонецПроцедуры
