///////////////////////////////////////////////////////////////////////
//
// Тест проверки поведения некоторых глобальных функций
// 
//
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТипБулево");
	 ВсеТесты.Добавить("ТестДолжен_ПроверитьТипСтроки");
	
	Возврат ВсеТесты;
КонецФункции

// 
////////////////////////////////////////////////////////////////////

Процедура ТестДолжен_ПроверитьТипБулево() Экспорт
	юТест.ПроверитьРавенство(Тип("Булево"), ТипЗнч(Истина), "Проверка для Истина");
	юТест.ПроверитьРавенство(Тип("Булево"), ТипЗнч(Ложь), "Проверка для Ложь");

	юТест.ПроверитьРавенство(Строка(Тип("Булево")), "Булево", "Тип(""Булево"") = ""Булево""");
	юТест.ПроверитьРавенство(Строка(ТипЗнч(Истина)), "Булево", "ТипЗнч(Истина) = ""Булево""");
	юТест.ПроверитьРавенство(Строка(ТипЗнч(Ложь)), "Булево", "ТипЗнч(Ложь) = ""Булево""");
КонецПроцедуры

Процедура ТестДолжен_ПроверитьТипСтроки() Экспорт
	юТест.ПроверитьРавенство(Тип("Строка"), ТипЗнч(""), "Проверка для пустой строки");
	юТест.ПроверитьРавенство(Тип("Строка"), ТипЗнч("   "), "Проверка для строки из пробелов");
	юТест.ПроверитьРавенство(Тип("Строка"), ТипЗнч("цущкг"), "Проверка для заполненной строки");

	юТест.ПроверитьРавенство(Строка(Тип("Строка")), "Строка", "Тип(""Строка"") = ""Строка""");
	юТест.ПроверитьРавенство(Строка(ТипЗнч("")), "Строка", "ТипЗнч(пустая строка) = ""Строка""");
	юТест.ПроверитьРавенство(Строка(ТипЗнч("  ")), "Строка", "ТипЗнч(строка из пробелов) = ""Строка""");
	юТест.ПроверитьРавенство(Строка(ТипЗнч("Ложь")), "Строка", "ТипЗнч(заполненная строка) = ""Строка""");
КонецПроцедуры

