///////////////////////////////////////////////////////////////////////
//
// Тест проверки поведения некоторых глобальных функций
// 
//
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьТипПримитивныхОбъектов");
	
	Возврат ВсеТесты;
КонецФункции

// 
////////////////////////////////////////////////////////////////////

Процедура ТестДолжен_ПроверитьТипПримитивныхОбъектов() Экспорт
	юТест.ПроверитьРавенство(Тип("Булево") = ТипЗнч(Истина), "Проверка для Истина");
	юТест.ПроверитьРавенство(Тип("Булево") = ТипЗнч(Истина), "Проверка для Истина");

	юТест.ПроверитьРавенство(Тип("Булево") = "Булево", "Тип(""Булево"") = ""Булево""");
КонецПроцедуры

