///////////////////////////////////////////////////////////////////////
//
// 
// 
//
///////////////////////////////////////////////////////////////////////

Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция Версия() Экспорт
	Возврат "0.1";
КонецФункции

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРавенствоNull");
	//ВсеТесты.Добавить("НесуществующийМетод");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПроверитьРавенствоNull() Экспорт
	
	А = Null;
	Б = Null;

	юТест.Проверить(А = Б и Б = Null и А = Null);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////
// Точка входа

//Инициализация();