Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	ЮнитТест.ПроверитьРавенство(ТипЗнч(НедопустимыеПодстановкиXS),             Тип("ПеречислениеНедопустимыеПодстановкиXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(НедопустимыеПодстановкиXS.Все),         Тип("НедопустимыеПодстановкиXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(НедопустимыеПодстановкиXS.Ограничение), Тип("НедопустимыеПодстановкиXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(НедопустимыеПодстановкиXS.Подстановка), Тип("НедопустимыеПодстановкиXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(НедопустимыеПодстановкиXS.Расширение),  Тип("НедопустимыеПодстановкиXS"));

КонецПроцедуры

Процедура TestConstructor() Экспорт

	ЮнитТест.ПроверитьРавенство(TypeOf(XSDisallowedSubstitutions),              Type("EnumerationXSDisallowedSubstitutions"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSDisallowedSubstitutions.All),          Type("XSDisallowedSubstitutions"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSDisallowedSubstitutions.Restriction),  Type("XSDisallowedSubstitutions"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSDisallowedSubstitutions.Substitution), Type("XSDisallowedSubstitutions"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSDisallowedSubstitutions.Extension),    Type("XSDisallowedSubstitutions"));

КонецПроцедуры

#КонецОбласти