Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	ЮнитТест.ПроверитьРавенство(ТипЗнч(ЗавершенностьПростогоТипаXS),      Тип("ПеречислениеЗавершенностьПростогоТипаXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(ЗавершенностьПростогоТипаXS.Все),         Тип("ЗавершенностьПростогоТипаXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(ЗавершенностьПростогоТипаXS.Объединение), Тип("ЗавершенностьПростогоТипаXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(ЗавершенностьПростогоТипаXS.Ограничение), Тип("ЗавершенностьПростогоТипаXS"));
	ЮнитТест.ПроверитьРавенство(ТипЗнч(ЗавершенностьПростогоТипаXS.Список),      Тип("ЗавершенностьПростогоТипаXS"));

КонецПроцедуры

Процедура TestConstructor() Экспорт

	ЮнитТест.ПроверитьРавенство(TypeOf(XSSimpleFinal),             Type("EnumerationXSSimpleFinal"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSSimpleFinal.All),         Type("XSSimpleFinal"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSSimpleFinal.Union),       Type("XSSimpleFinal"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSSimpleFinal.Restriction), Type("XSSimpleFinal"));
	ЮнитТест.ПроверитьРавенство(TypeOf(XSSimpleFinal.List),        Type("XSSimpleFinal"));

КонецПроцедуры

#КонецОбласти