ТестовыйМассив = Новый Массив;               //- $entry: 1
ТестовыйМассив.Добавить(1);                  //- $entry: 1
ТестовыйМассив.Добавить(2);                  //- $entry: 1
ТестовыйМассив.Добавить(3);                  //- $entry: 1
ТестовыйМассив.Добавить(4);                  //- $entry: 1

Для Каждого мЗначение Из ТестовыйМассив Цикл //- $entry: 3

	Если мЗначение = 3 Тогда                 //- $entry: 3
		Прервать;                            //- $entry: 1
	КонецЕсли;                               //- $entry: 2

КонецЦикла;                                  //- $entry: 2
