Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.1";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	СписокТестов.Добавить("ТестРавенство");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	РасширенноеИмя = Новый РасширенноеИмяXML("http://www.w3.org/2001/XMLSchema", "string");

	ЮнитТест.ПроверитьРавенство(ТипЗнч(РасширенноеИмя),             Тип("РасширенноеИмяXML"));
	ЮнитТест.ПроверитьРавенство(РасширенноеИмя.ЛокальноеИмя,        "string");
	ЮнитТест.ПроверитьРавенство(РасширенноеИмя.URIПространстваИмен, "http://www.w3.org/2001/XMLSchema");

КонецПроцедуры

Процедура TestConstructor() Экспорт

	ExpandedName = New XMLExpandedName("http://www.w3.org/2001/XMLSchema", "string");

	ЮнитТест.ПроверитьРавенство(TypeOf(ExpandedName),      Type("XMLExpandedName"));
	ЮнитТест.ПроверитьРавенство(ExpandedName.LocalName,    "string");
	ЮнитТест.ПроверитьРавенство(ExpandedName.NamespaceURI, "http://www.w3.org/2001/XMLSchema");

КонецПроцедуры

Процедура ТестРавенство() Экспорт

	РасширенноеИмя1 = Новый РасширенноеИмяXML("http://www.w3.org/2001/XMLSchema", "string");
	РасширенноеИмя2 = Новый РасширенноеИмяXML("http://www.w3.org/2001/XMLSchema", "string");

	ЮнитТест.ПроверитьРавенство(РасширенноеИмя1, РасширенноеИмя1);
	ЮнитТест.ПроверитьРавенство(РасширенноеИмя1, РасширенноеИмя2);

КонецПроцедуры

#КонецОбласти