#Использовать "fails"

	// <class name="loadfail" file="load-fail.os"/>
Процедура МетодСценария() Экспорт
    ТекПуть = Новый Файл(ТекущийСценарий().Источник).Путь;
    ЗагрузитьСценарий(ОбъединитьПути(ТекПуть,"fail.os")); 
КонецПроцедуры

Процедура МетодОбъектаБиблиотеки() Экспорт
    // Сообщить("до ТестСценарий = Новый fail;");
    ТестСценарий = Новый fail;
    // Сообщить("После  ТестСценарий = Новый fail;");
    ТестСценарий.Метод();
    // Сообщить("После  ТестСценарий.Метод();");
КонецПроцедуры

