#Использовать asserts

Перем юТест;
Перем ТекстПроверки;

Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	СписокТестов.Добавить("Тест_Должен_ПроверитьПараметрыЗаписиJSONПоУмолчанию");
	СписокТестов.Добавить("Тест_Должен_ПроверитьУстановленныеПараметрыПоУмолчанию");
	СписокТестов.Добавить("Тест_Должен_СверитьСтрокуСоСпецСимволами");
	СписокТестов.Добавить("Тест_Должен_СверитьСтрокуССимволамиВнеBMP");
	СписокТестов.Добавить("Тест_Должен_СверитьСтрокуСЭкранированнымиКириллическимиСимволами");
	СписокТестов.Добавить("Тест_Должен_СверитьСтрокуСЭкранированнымиСимволами_БезПараметров");
	СписокТестов.Добавить("Тест_Должен_СверитьСтрокуСЭкранированнымиСимволами_СПараметрами");
    СписокТестов.Добавить("Тест_Должен_ПроверитьИсключенияДляНедопустимыхТипов");
	
	СписокТестов.Добавить("Тест_Должен_СверитьХешСуммуСгенерированнойСтрокиJSON");
	СписокТестов.Добавить("Тест_Должен_СверитьХешСуммуСгенерированнойМетодомЗаписатьJSONСтруктуры");
	СписокТестов.Добавить("Тест_Должен_СверитьХешСуммуСгенерированнойМетодомЗаписатьJSONСтруктурыСФиксированнымиКоллекциями");
	СписокТестов.Добавить("Тест_Должен_ПроверитьПустуюСтрокуПриЗакрытии");
    СписокТестов.Добавить("Тест_Должен_ПроверитьСохранениеУстановленнойСтроки");
    СписокТестов.Добавить("Тест_Должен_ПроверитьЗаписьВПоток");
    СписокТестов.Добавить("Тест_Должен_ПроверитьСохранениеПотокаПослеЗакрытия");
    СписокТестов.Добавить("Тест_Должен_ПроверитьИсключениеНаПотокеТолькоДляЧтения");
	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_СверитьХешСуммуСгенерированнойСтрокиJSON() Экспорт
	
	Запись = Новый ЗаписьJson();
	Параметры = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows);
	юТест.ПроверитьРавенство(ПереносСтрокJSON.Windows, Параметры.ПереносСтрок, "ПереносСтрок.Windows");

	Запись.УстановитьСтроку(Параметры);
	Запись.ЗаписатьНачалоОбъекта();
	Запись.ЗаписатьИмяСвойства("firstName");
	Запись.ЗаписатьЗначение("Иван");
	Запись.ЗаписатьИмяСвойства("lastName");
	Запись.ЗаписатьЗначение("""Иванов""");
	
	Запись.ЗаписатьИмяСвойства("address");	
	Запись.ЗаписатьНачалоОбъекта();
	Запись.ЗаписатьИмяСвойства("streetAddress");
	Запись.ЗаписатьЗначение("Московское ш., 101, кв.101");
	Запись.ЗаписатьИмяСвойства("city");
	Запись.ЗаписатьЗначение("Ленинград");
	Запись.ЗаписатьИмяСвойства("postalCode");
	Запись.ЗаписатьЗначение(101101);
	Запись.ЗаписатьИмяСвойства("float");
	Запись.ЗаписатьЗначение(1.54);
	Запись.ЗаписатьИмяСвойства("undefined");
	Запись.ЗаписатьЗначение(Неопределено);
	Запись.ЗаписатьКонецОбъекта();

	Запись.ЗаписатьИмяСвойства("phoneNumbers");
	Запись.ЗаписатьНачалоМассива();
	Запись.ЗаписатьЗначение("812 123-1234");
	Запись.ЗаписатьЗначение("916 123-4567");
	Запись.ЗаписатьКонецМассива();
	
	Запись.ЗаписатьКонецОбъекта();
	
	Текст = Запись.Закрыть();

	Хеширование = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование.Добавить(Текст);	
		
	юТест.ПроверитьРавенство(Хеширование.ХешСумма, 2627237007);
	
КонецПроцедуры

Процедура Тест_Должен_СверитьСтрокуСЭкранированнымиКириллическимиСимволами() Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Параметры = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows, , , ЭкранированиеСимволовJSON.СимволыВнеASCII);
			
	ЗаписьJSON.УстановитьСтроку(Параметры);

	ЗаписатьJSON(ЗаписьJSON, "Символы кириллицы");

	юТест.ПроверитьРавенство(ЗаписьJSON.Закрыть(), """\u0421\u0438\u043C\u0432\u043E\u043B\u044B \u043A\u0438\u0440\u0438\u043B\u043B\u0438\u0446\u044B""");
	
КонецПроцедуры

Процедура Тест_Должен_СверитьСтрокуСоСпецСимволами() Экспорт
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON,  Символ(1) + Символ(31));
	юТест.ПроверитьРавенство(ЗаписьJSON.Закрыть(), """\u0001\u001F""");
		
КонецПроцедуры

Процедура Тест_Должен_СверитьСтрокуССимволамиВнеBMP() Экспорт
		
	ЗаписьJSON = Новый ЗаписьJSON;
	Параметры = Новый ПараметрыЗаписиJSON(, , , ЭкранированиеСимволовJSON.СимволыВнеBMP);
	ЗаписьJSON.УстановитьСтроку(Параметры);

	ЗаписатьJSON(ЗаписьJSON,  "Ключ: "+Символ(55348)+Символ(56606));
	юТест.ПроверитьРавенство(ЗаписьJSON.Закрыть(), """Ключ: \uD834\uDD1E""");
		
КонецПроцедуры

Процедура Тест_Должен_ПроверитьПараметрыЗаписиJSONПоУмолчанию() Экспорт
	Параметры = Новый ПараметрыЗаписиJSON;

	юТест.ПроверитьРавенство(ПереносСтрокJSON.Авто, Параметры.ПереносСтрок, "ПереносСтрок");
	юТест.ПроверитьРавенство("", Параметры.СимволыОтступа, "СимволыОтступа");
	юТест.ПроверитьИстину(Параметры.ИспользоватьДвойныеКавычки, "ИспользоватьДвойныеКавычки");
	юТест.ПроверитьРавенство( ЭкранированиеСимволовJSON.Нет, Параметры.ЭкранированиеСимволов, "ЭкранированиеСимволов");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьУгловыеСкобки, "ЭкранироватьУгловыеСкобки");
	юТест.ПроверитьИстину(Параметры.ЭкранироватьРазделителиСтрок, "ЭкранироватьРазделителиСтрок");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьАмперсанд, "ЭкранироватьАмперсанд");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьОдинарныеКавычки, "ЭкранироватьОдинарныеКавычки");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьСлеш, "ЭкранироватьСлеш");
	
КонецПроцедуры

Процедура Тест_Должен_ПроверитьУстановленныеПараметрыПоУмолчанию() Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	Параметры = ЗаписьJSON.Параметры;
	ЗаписьJSON.Закрыть();

	юТест.ПроверитьРавенство(ПереносСтрокJSON.Авто, Параметры.ПереносСтрок, "ПереносСтрок");
	юТест.ПроверитьРавенство("", Параметры.СимволыОтступа, "СимволыОтступа");
	юТест.ПроверитьИстину(Параметры.ИспользоватьДвойныеКавычки, "ИспользоватьДвойныеКавычки");
	юТест.ПроверитьРавенство( ЭкранированиеСимволовJSON.Нет, Параметры.ЭкранированиеСимволов, "ЭкранированиеСимволов");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьУгловыеСкобки, "ЭкранироватьУгловыеСкобки");
	юТест.ПроверитьИстину(Параметры.ЭкранироватьРазделителиСтрок, "ЭкранироватьРазделителиСтрок");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьАмперсанд, "ЭкранироватьАмперсанд");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьОдинарныеКавычки, "ЭкранироватьОдинарныеКавычки");
	юТест.ПроверитьЛожь(Параметры.ЭкранироватьСлеш, "ЭкранироватьСлеш");
	
КонецПроцедуры

Процедура Тест_Должен_СверитьСтрокуСЭкранированнымиСимволами_БезПараметров() Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписьJSON.ЗаписатьЗначение("""\<&>/'"+Символ(13)+Символ(10)+Символ(12)+Символ(8)+Символ(9));
	Рез = ЗаписьJSON.Закрыть();

	юТест.ПроверитьРавенство("""\""\\<&>/'\r\n\f\b\t""", Рез);
	
КонецПроцедуры

Процедура Тест_Должен_СверитьСтрокуСЭкранированнымиСимволами_СПараметрами() Экспорт
	Параметры = Новый ПараметрыЗаписиJSON(
	, // ПереносСтрок
	, // СимволыОтступа
	Ложь, // ИспользоватьДвойныеКавычки
	ЭкранированиеСимволовJSON.Нет, // ЭкранированиеСимволов
	Истина, // ЭкранироватьУгловыеСкобки
	Истина, // ЭкранироватьРазделителиСтрок
	Истина, // ЭкранироватьАмперсанд
	Истина, // ЭкранироватьОдинарныеКавычки
	Истина // ЭкранироватьСлеш
	);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Параметры);
	
	ЗаписьJSON.ЗаписатьЗначение("""\<&>/'"+Символ(8232)+Символ(8233));
	Рез = ЗаписьJSON.Закрыть();

	юТест.ПроверитьРавенство("'\""\\\u003C\u0026\u003E\/\u0027\u2028\u2029'", Рез);
	
КонецПроцедуры


Процедура Тест_Должен_СверитьХешСуммуСгенерированнойМетодомЗаписатьJSONСтруктурыСФиксированнымиКоллекциями() Экспорт
	
	Запись = Новый ЗаписьJson();
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows));
	
	Структура = Новый Структура();
	
	МассивОбычный = Новый Массив();
	МассивОбычный.Добавить("1");
	
	ВложенныйМассив = Новый Массив();
	ВложенныйМассив.Добавить("2.1");
	ВложенныйМассив.Добавить("2.2");
	ФиксМассив = Новый ФиксированныйМассив(ВложенныйМассив);
	
	МассивОбычный.Добавить(ФиксМассив);
	
	Структура.Вставить("МассивОбычный", МассивОбычный);
	
	соответствие = Новый Соответствие();
	соответствие.Вставить("ЭлементСоответствия", "ЗначениеСоовтетствия");
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(соответствие);
	Структура.Вставить("ФиксированноеСоответствие", ФиксированноеСоответствие);
	
	ФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(Структура);
	
	ЗаписатьJSON(Запись, ФиксированнаяСтруктура);	
	
	Текст = Запись.Закрыть();
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование.Добавить(Текст);	
	
	юТест.ПроверитьРавенство(Хеширование.ХешСумма, 3499253905);
	
КонецПроцедуры

Процедура Тест_Должен_СверитьХешСуммуСгенерированнойМетодомЗаписатьJSONСтруктуры() Экспорт
	
	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать("json/json-mock_struct.json", КодировкаТекста.UTF8);

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текст.ПолучитьТекст());
	Структура = ПрочитатьJSON(Чтение);
	
	Запись = Новый ЗаписьJson();
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows));	
	ЗаписатьJSON(Запись, Структура);	
	
	Текст = Запись.Закрыть();
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование.Добавить(Текст);	
	
	юТест.ПроверитьРавенство(Хеширование.ХешСумма, 3352482152);
	
КонецПроцедуры

Процедура Тест_Должен_ПроверитьПустуюСтрокуПриЗакрытии() Экспорт
	Файл = ПолучитьИмяВременногоФайла(".json");

	Соотв=Новый Соответствие();
	Соотв.Вставить("value",0);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Соотв);

	Соотв["value"]=1;
	ЗаписьJSON.ОткрытьФайл(Файл);
	ЗаписатьJSON(ЗаписьJSON, Соотв);

	Результат = ЗаписьJSON.Закрыть();
	УдалитьФайлы(Файл);
	
	юТест.ПроверитьРавенство(Результат, "");
КонецПроцедуры

Процедура Тест_Должен_ПроверитьСохранениеУстановленнойСтроки() Экспорт
	Файл = ПолучитьИмяВременногоФайла(".json");

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьБезОбработки("{");

	Попытка
		ЗаписьJSON.ОткрытьФайл(Файл+"/*");
	Исключение
	КонецПопытки;

	ЗаписьJSON.ЗаписатьБезОбработки("}");
	Результат = ЗаписьJSON.Закрыть();
	
	юТест.ПроверитьРавенство(Результат, "{}");
КонецПроцедуры

Процедура ПопыткаЗаписатьЗначение(Зн) 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	Попытка
		ЗаписьJSON.ЗаписатьЗначение(зн);
	Исключение
		ЗаписьJSON.Закрыть();
		возврат;
	КонецПопытки;

	ЗаписьJSON.Закрыть();
	ВызватьИсключение "Должно было быть выдано исключение для типа "+ТипЗнч(Зн)+", но его не было";
КонецПроцедуры

Процедура Тест_Должен_ПроверитьИсключенияДляНедопустимыхТипов() Экспорт

		Массив = Новый Массив();
		ПопыткаЗаписатьЗначение(Массив);
	
		Структура = Новый Структура();
		ПопыткаЗаписатьЗначение(Структура);
КонецПроцедуры

Процедура Тест_Должен_ПроверитьЗаписьВПоток() Экспорт
	Поток = Новый ПотокВПамяти(64);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьПоток(Поток);
	ЗаписьJSON.ЗаписатьБезОбработки("123");
	РезЗаписи = ЗаписьJSON.Закрыть();
	РезПотока =  Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	юТест.ПроверитьРавенство("", РезЗаписи);
	юТест.ПроверитьРавенство("31 32 33", Строка(РезПотока));
КонецПроцедуры

Процедура Тест_Должен_ПроверитьСохранениеПотокаПослеЗакрытия() Экспорт
	Поток = Новый ПотокВПамяти(64);
	Поток.Записать(ПолучитьБуферДвоичныхДанныхИзСтроки("01"),0,2); 

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьПоток(Поток);
	ЗаписьJSON.ЗаписатьБезОбработки("23");
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьБезОбработки("45");
	РезЗаписи = ЗаписьJSON.Закрыть();

	Поток.Записать(ПолучитьБуферДвоичныхДанныхИзСтроки("67"),0,2); 
	РезПотока =  Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	юТест.ПроверитьРавенство("45", РезЗаписи);
	юТест.ПроверитьРавенство("30 31 32 33 36 37", Строка(РезПотока));
КонецПроцедуры

// отличается от 1С
Процедура Тест_Должен_ПроверитьИсключениеНаПотокеТолькоДляЧтения() Экспорт
	Поток = Новый ПотокВПамяти(64);
	ПотокЧтения = Поток.ПолучитьПотокТолькоДляЧтения();

	ЗаписьJSON = Новый ЗаписьJSON;
	Попытка
		ЗаписьJSON.ОткрытьПоток(ПотокЧтения); // OneScript падает здесь
	Исключение
		Возврат;
	КонецПопытки;
	
	ЗаписьJSON.ЗаписатьБезОбработки("123");  // 1C падает здесь
	ЗаписьJSON.Закрыть();

	ВызватьИсключение "Должно было быть выдано исключение, но его не было";
КонецПроцедуры


