Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;	
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	
	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Сериализатор = Новый СериализаторXDTO;
	
	ЮнитТест.ПроверитьРавенство(ТипЗнч(Сериализатор), Тип("СериализаторXDTO"));
	
КонецПроцедуры

Procedure TestConstructor() Export

	Serializer = New XDTOSerializer;
	
	ЮнитТест.ПроверитьРавенство(TypeOf(Serializer), Type("XDTOSerializer"));

EndProcedure

Процедура ТестСтрока() Экспорт

	СериализаторXDTO = Новый СериализаторXDTO;

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();

	ЗаписьXML.ЗаписатьНачалоЭлемента("test");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");

	ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test11", НазначениеТипаXML.Неявное, ФормаXML.Элемент);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test12", НазначениеТипаXML.Явное, ФормаXML.Элемент);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test21", НазначениеТипаXML.Неявное, ФормаXML.Атрибут);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test22", НазначениеТипаXML.Явное, ФормаXML.Атрибут);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test31", НазначениеТипаXML.Неявное, ФормаXML.Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test32", НазначениеТипаXML.Явное, ФормаXML.Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();

	ТекстXML = ЗаписьXML.Закрыть();

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);

	ЧтениеXML.Прочитать(); // "test"
	ЧтениеXML.Прочитать(); // "test1"

	ЧтениеXML.Прочитать(); // "string"
	Строка = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("Строка"));
	ЮнитТест.ПроверитьРавенство(Строка, "test11");

	ЧтениеXML.Прочитать(); // "/test1"

	ЧтениеXML.Прочитать(); // "test1"



КонецПроцедуры


Процедура аываыва()

	//ЗаписьXML.ЗаписатьНачалоЭлемента("test");
	//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema");
	//ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	//
	//ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test11", НазначениеТипаXML.Неявное, ФормаXML.Элемент);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test12", НазначениеТипаXML.Явное, ФормаXML.Элемент);
	//ЗаписьXML.ЗаписатьКонецЭлемента();

	//ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test21", НазначениеТипаXML.Неявное, ФормаXML.Атрибут);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test22", НазначениеТипаXML.Явное, ФормаXML.Атрибут);
	//ЗаписьXML.ЗаписатьКонецЭлемента();

	//ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test31", НазначениеТипаXML.Неявное, ФормаXML.Текст);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	//СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test32", НазначениеТипаXML.Явное, ФормаXML.Текст);
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	


	// ЗаписьXML.ЗаписатьНачалоЭлемента("test");
	// ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema");
	// ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 11, НазначениеТипаXML.Неявное, ФормаXML.Элемент);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 12, НазначениеТипаXML.Явное, ФормаXML.Элемент);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

	// ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 21, НазначениеТипаXML.Неявное, ФормаXML.Атрибут);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 22, НазначениеТипаXML.Явное, ФормаXML.Атрибут);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

	// ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 31, НазначениеТипаXML.Неявное, ФормаXML.Текст);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 32, НазначениеТипаXML.Явное, ФормаXML.Текст);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

#КонецОбласти

Если СтартовыйСценарий().Источник = ТекущийСценарий().Источник Тогда
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();

	СериализаторXDTO = Новый СериализаторXDTO;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("test");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");

	ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test11", НазначениеТипаXML.Неявное, ФормаXML.Элемент);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test12", НазначениеТипаXML.Явное, ФормаXML.Элемент);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test21", НазначениеТипаXML.Неявное, ФормаXML.Атрибут);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test22", НазначениеТипаXML.Явное, ФормаXML.Атрибут);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test31", НазначениеТипаXML.Неявное, ФормаXML.Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, "test32", НазначениеТипаXML.Явное, ФормаXML.Текст);
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test");
	// ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://www.w3.org/2001/XMLSchema");
	// ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");

	// ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 11, НазначениеТипаXML.Неявное, ФормаXML.Элемент);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test1");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 12, НазначениеТипаXML.Явное, ФормаXML.Элемент);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

	// ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 21, НазначениеТипаXML.Неявное, ФормаXML.Атрибут);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test2");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 22, НазначениеТипаXML.Явное, ФормаXML.Атрибут);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

	// ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 31, НазначениеТипаXML.Неявное, ФормаXML.Текст);
	// ЗаписьXML.ЗаписатьКонецЭлемента();
	// ЗаписьXML.ЗаписатьНачалоЭлемента("test3");
	// СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 32, НазначениеТипаXML.Явное, ФормаXML.Текст);
	// ЗаписьXML.ЗаписатьКонецЭлемента();

	// ЗаписьXML.ЗаписатьКонецЭлемента();

	ТекстXML = ЗаписьXML.Закрыть();

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);

	ЧтениеXML.Прочитать(); // "test"
	ЧтениеXML.Прочитать(); // "test1"

	ЧтениеXML.Прочитать(); // "string"

	Строка = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("Строка"));
	ЧтениеXML.Прочитать(); // "test"

	ЧтениеXML.Прочитать(); // "test1"
	ЧтениеXML.Прочитать(); // "test1"
	ЧтениеXML.Прочитать(); // "test1"

	Строка = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("Строка"));

	Сообщить("Строка {" + Строка + "}");
	Сообщить("Строка {" + ЧтениеXML.ТипУзла + "} " + ЧтениеXML.Имя);
	
	Сообщить(ТекущаяДата());
	Сообщить("НачалоПримера");
	Сообщить(ТекстXML);
	Сообщить("КонецПримера");
	
КонецЕсли;