
Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьMD5");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA1");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA256");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA384");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA512");
	
	Возврат ВсеТесты;
КонецФункции


Процедура ТестДолжен_ПроверитьMD5() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.MD5);
	Провайдер.Добавить("123");
	Провайдер.Добавить("456");
	Провайдер.Добавить("789");

	юТест.ПроверитьРавенство("25F9E794323B453885F5181F1B624D0B",Провайдер.ХешСуммаСтрокой);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA1() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA1);
	Провайдер.Добавить("123");
	Провайдер.Добавить("456");
	Провайдер.Добавить("789");

	юТест.ПроверитьРавенство("F7C3BC1D808E04732ADF679965CCC34CA7AE3441",Провайдер.ХешСуммаСтрокой);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA256() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA256);
	Провайдер.Добавить("123");
	Провайдер.Добавить("456");
	Провайдер.Добавить("789");

	юТест.ПроверитьРавенство("15E2B0D3C33891EBB0F1EF609EC419420C20E320CE94C65FBC8C3312448EB225",Провайдер.ХешСуммаСтрокой);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA384() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA384);
	Провайдер.Добавить("123");
	Провайдер.Добавить("456");
	Провайдер.Добавить("789");

	юТест.ПроверитьРавенство("EB455D56D2C1A69DE64E832011F3393D45F3FA31D6842F21AF92D2FE469C499DA5E3179847334A18479C8D1DEDEA1BE3",Провайдер.ХешСуммаСтрокой);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA512() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA512);
	Провайдер.Добавить("123");
	Провайдер.Добавить("456");
	Провайдер.Добавить("789");

	юТест.ПроверитьРавенство("D9E6762DD1C8EAF6D61B3C6192FC408D4D6D5F1176D0C29169BC24E71C3F274AD27FCD5811B313D681F7E55EC02D73D499C95455B6B5BB503ACF574FBA8FFE85",Провайдер.ХешСуммаСтрокой);
КонецПроцедуры