
Перем юТест;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьMD5");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA1");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA256");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA384");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьSHA512");
	
	Возврат ВсеТесты;
КонецФункции


Процедура ТестДолжен_ПроверитьMD5() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.MD5);
	Провайдер.Добавить("123");

	юТест.ПроверитьРавенство("202CB962AC59075B964B07152D234B70",Провайдер.ХешСумма);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA1() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA1);
	Провайдер.Добавить("123");

	юТест.ПроверитьРавенство("40BD001563085FC35165329EA1FF5C5ECBDBBEEF",Провайдер.ХешСумма);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA256() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA256);
	Провайдер.Добавить("123");

	юТест.ПроверитьРавенство("A665A45920422F9D417E4867EFDC4FB8A04A1F3FFF1FA07E998E86F7F7A27AE3",Провайдер.ХешСумма);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA384() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA384);
	Провайдер.Добавить("123");

	юТест.ПроверитьРавенство("9A0A82F0C0CF31470D7AFFEDE3406CC9AA8410671520B727044EDA15B4C25532A9B5CD8AAF9CEC4919D76255B6BFB00F",Провайдер.ХешСумма);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьSHA512() Экспорт
	Провайдер=Новый ХешированиеДанных(ХешФункция.SHA512);
	Провайдер.Добавить("123");

	юТест.ПроверитьРавенство("3C9909AFEC25354D551DAE21590BB26E38D53F2173B8D3DC3EEE4C047E7AB1C1EB8B85103E3BE7BA613B31BB5C9C36214DC9F14A42FD7A2FDB84856BCA5C44C2",Провайдер.ХешСумма);
КонецПроцедуры