#использовать asserts

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	СхемаXML = Новый СхемаXML;

	Ожидаем.Что(СхемаXML.ТипКомпоненты).Равно(ТипКомпонентыXS.Схема);
	Ожидаем.Что(СхемаXML.URIПространстваИменСхемыДляСхемыXML).Равно("http://www.w3.org/2001/XMLSchema");
	Ожидаем.Что(СхемаXML.Содержимое.Количество()).Равно(0);
	Ожидаем.Что(СхемаXML.Директивы.Количество()).Равно(0);
	
	ОсвободитьОбъект(СхемаXML);

КонецПроцедуры

Процедура ТестКонструкторТекстXML() Экспорт

	СхемаXML = Новый СхемаXML;

	ТекстСхемыXML = 
		"<?xml version=""1.0"" encoding=""utf-16""?>
		|<xs:schema xmlns:xs=""http://www.w3.org/2001/XMLSchema"" />";

	Ожидаем.Что(СхемаXML.ТекстXML()).Равно(ТекстСхемыXML);
	
	ОсвободитьОбъект(СхемаXML);

КонецПроцедуры

Процедура ТестУстановитьПространствоИмен() Экспорт

	СхемаXML = Новый СхемаXML;
	СхемаXML.ПространствоИмен = "https://oscript.io";

	Ожидаем.Что(СхемаXML.ПространствоИмен).Равно("https://oscript.io");

	ОсвободитьОбъект(СхемаXML);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	//МенеджерТестирования.ДобавитьТест("ТестКонструкторТекстXML");
	МенеджерТестирования.ДобавитьТест("ТестУстановитьПространствоИмен");

	Возврат Неопределено;

КонецФункции

#КонецОбласти