Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	СписокТестов.Добавить("ТестРасположениеСхемы");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Включение = Новый ВключениеXS;
	ЮнитТест.ПроверитьРавенство(Включение.ТипКомпоненты, ТипКомпонентыXS.Включение);

КонецПроцедуры

Procedure TestConstructor() Export

	Include = new XSInclude;

	ЮнитТест.ПроверитьРавенство(Include.ComponentType, XSComponentType.Include);
	
EndProcedure

Процедура ТестРасположениеСхемы() Экспорт

	Включение = Новый ИмпортXS;
	Включение.РасположениеСхемы = "example.xsd";

	ЮнитТест.ПроверитьРавенство(Включение.РасположениеСхемы, "example.xsd");
	
КонецПроцедуры

#КонецОбласти