#использовать asserts

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	Документация = Новый ДокументацияXS;

	Ожидаем.Что(Документация.ТипКомпоненты).Равно(ТипКомпонентыXS.Документация);
	

	ОсвободитьОбъект(Документация);

КонецПроцедуры

Процедура ТестУстановитьЯзык() Экспорт

	Документация = Новый ДокументацияXS;
	Документация.Язык = "ru";

	Ожидаем.Что(Документация.Язык).Равно("ru");

	ОсвободитьОбъект(Документация);

КонецПроцедуры

Процедура ТестУстановитьИсточник() Экспорт

	Документация = Новый ДокументацияXS;
	Документация.Источник = "https://oscript.io";

	Ожидаем.Что(Документация.Источник).Равно("https://oscript.io");

	ОсвободитьОбъект(Документация);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("ТестУстановитьЯзык");
	МенеджерТестирования.ДобавитьТест("ТестУстановитьИсточник");

	Возврат Неопределено;

КонецФункции

#КонецОбласти