#Использовать asserts

Перем ЮнитТест;

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	Импорт = Новый ИмпортXS;

	Ожидаем.Что(Импорт.ТипКомпоненты).Равно(ТипКомпонентыXS.Импорт);
	
	ОсвободитьОбъект(Импорт);

КонецПроцедуры

Procedure TestConstructor() Export

	Import = New XSImport;

	Ожидаем.Что(Import.ComponentType).Равно(XSComponentType.Import);
	
	FreeObject(Import);

EndProcedure

Процедура ТестПрострастранствоИмен() Экспорт

	Импорт = Новый ИмпортXS;
	Импорт.ПространствоИмен = "http://www.example.com/IPO";

	Ожидаем.Что(Импорт.ПространствоИмен).Равно("http://www.example.com/IPO");
	
	ОсвободитьОбъект(Импорт);

КонецПроцедуры

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("TestConstructor");
	МенеджерТестирования.ДобавитьТест("ТестПрострастранствоИмен");

	Возврат Неопределено;

КонецФункции

#КонецОбласти