Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	СписокТестов.Добавить("ТестИмя");

	
	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	ОпределениеТипа = Новый ОпределениеСоставногоТипаXS;
	
	ЮнитТест.ПроверитьРавенство(ТипЗнч(ОпределениеТипа), Тип("ОпределениеСоставногоТипаXS"));
	ЮнитТест.ПроверитьРавенство(ОпределениеТипа.ТипКомпоненты, ТипКомпонентыXS.ОпределениеСоставногоТипа);
	ЮнитТест.ПроверитьРавенство(ОпределениеТипа.Компоненты.Количество(), 0);

КонецПроцедуры

Procedure TestConstructor() Export

	TypeDefinition = New XSComplexTypeDefinition;

	ЮнитТест.ПроверитьРавенство(TypeOf(TypeDefinition), Type("XSComplexTypeDefinition"));
	ЮнитТест.ПроверитьРавенство(TypeDefinition.ComponentType, XSComponentType.ComplexTypeDefinition);

EndProcedure

Процедура ТестИмя() Экспорт

	ОпределениеТипа = Новый ОпределениеСоставногоТипаXS;

	ОпределениеТипа.Имя = "test";

	ЮнитТест.ПроверитьРавенство(ОпределениеТипа.Имя, "test");

КонецПроцедуры

#КонецОбласти