#Использовать asserts

Перем ЮнитТест;

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	Включение = Новый ВключениеXS;
	Ожидаем.Что(Включение.ТипКомпоненты).Равно(ТипКомпонентыXS.Включение);
	
	ОсвободитьОбъект(Включение);

КонецПроцедуры

Procedure TestConstructor() Export

	Include = new XSInclude;

	Ожидаем.Что(Include.ComponentType).Равно(XSComponentType.Include);
	
	FreeObject(Include);

EndProcedure

Процедура ТестРасположениеСхемы() Экспорт

	Включение = Новый ИмпортXS;
	Включение.РасположениеСхемы = "example.xsd";

	Ожидаем.Что(Включение.РасположениеСхемы).Равно("example.xsd");
	
	ОсвободитьОбъект(Включение);

КонецПроцедуры

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("TestConstructor");
	МенеджерТестирования.ДобавитьТест("ТестРасположениеСхемы");

	Возврат Неопределено;

КонецФункции

#КонецОбласти