Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	СписокТестов.Добавить("ТестПрострастранствоИмен");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Импорт = Новый ИмпортXS;

	ЮнитТест.ПроверитьРавенство(Импорт.ТипКомпоненты, ТипКомпонентыXS.Импорт);
	
КонецПроцедуры

Procedure TestConstructor() Export

	Import = New XSImport;

	ЮнитТест.ПроверитьРавенство(Import.ComponentType, XSComponentType.Import);

EndProcedure

Процедура ТестПрострастранствоИмен() Экспорт

	Импорт = Новый ИмпортXS;
	Импорт.ПространствоИмен = "http://www.example.com/IPO";

	ЮнитТест.ПроверитьРавенство(Импорт.ПространствоИмен, "http://www.example.com/IPO");
	
КонецПроцедуры

#КонецОбласти