Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Переопределение = Новый ПереопределениеXS;
	
	ЮнитТест.ПроверитьРавенство(Переопределение.ТипКомпоненты, ТипКомпонентыXS.Переопределение);
	
КонецПроцедуры

Procedure TestConstructor() Export

	Redefine = new XSRedefine;

	ЮнитТест.ПроверитьРавенство(Redefine.ComponentType, XSComponentType.Redefine);

EndProcedure

#КонецОбласти