#Использовать asserts

Перем ЮнитТест;

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	ИнформацияДляПриложения = Новый ИнформацияДляПриложенияXS;
	
	Ожидаем.Что(ИнформацияДляПриложения.ТипКомпоненты).Равно(ТипКомпонентыXS.ИнформацияПриложения);
	
	ОсвободитьОбъект(ИнформацияДляПриложения);

КонецПроцедуры

Procedure TestConstructor() Export

	AppInfo = new XSAppInfo;

	Ожидаем.Что(AppInfo.ComponentType).Равно(XSComponentType.AppInfo);
	
	FreeObject(AppInfo);

EndProcedure

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("TestConstructor");

	Возврат Неопределено;

КонецФункции

#КонецОбласти