Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	ОбъявлениеЭлемента = Новый ОбъявлениеЭлементаXS;
	
	ЮнитТест.ПроверитьРавенство(ОбъявлениеЭлемента.ТипКомпоненты, ТипКомпонентыXS.ОбъявлениеЭлемента);
	
КонецПроцедуры

Procedure TestConstructor() Export

	ElementDeclaration = new XSElementDeclaration;

	ЮнитТест.ПроверитьРавенство(ElementDeclaration.ComponentType, XSComponentType.ElementDeclaration);

EndProcedure

#КонецОбласти