Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.1";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("TestConstructor");
	СписокТестов.Добавить("ТестИмя");
	СписокТестов.Добавить("ТестИмяТипа");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	ОбъявлениеЭлемента = Новый ОбъявлениеЭлементаXS;
	
	ЮнитТест.ПроверитьРавенство(ОбъявлениеЭлемента.ТипКомпоненты, ТипКомпонентыXS.ОбъявлениеЭлемента);
	
КонецПроцедуры

Procedure TestConstructor() Export

	ElementDeclaration = new XSElementDeclaration;

	ЮнитТест.ПроверитьРавенство(ElementDeclaration.ComponentType, XSComponentType.ElementDeclaration);

EndProcedure

Процедура ТестИмя() Экспорт

	ОбъявлениеЭлемента = Новый ОбъявлениеЭлементаXS;

	ОбъявлениеЭлемента.Имя = "test";

	ЮнитТест.ПроверитьРавенство(ОбъявлениеЭлемента.Имя, "test");

КонецПроцедуры

Процедура ТестИмяТипа() Экспорт

	ОбъявлениеЭлемента = Новый ОбъявлениеЭлементаXS;
	ИмяТипа = Новый РасширенноеИмяXML("http://www.w3.org/2001/XMLSchema", "string");

	ОбъявлениеЭлемента.ИмяТипа = ИмяТипа;

	ЮнитТест.ПроверитьРавенство(ОбъявлениеЭлемента.ИмяТипа, ИмяТипа);

КонецПроцедуры

#КонецОбласти