#Использовать asserts

Перем ЮнитТест;

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	Аннотация = Новый АннотацияXS;
	
	Ожидаем.Что(Аннотация.ТипКомпоненты).Равно(ТипКомпонентыXS.Аннотация);
	
	ОсвободитьОбъект(Аннотация);

КонецПроцедуры

Procedure TestConstructor() Export

	Annotation = new XSAnnotation;

	Ожидаем.Что(Annotation.ComponentType).Равно(XSComponentType.Annotation);
	
	FreeObject(Annotation);

EndProcedure

Процедура ТестДобавитьДокументацию() Экспорт

	Аннотация = Новый АннотацияXS;
	
	Документация = Новый ДокументацияXS;
	Аннотация.Состав.Добавить(Документация);
	
	Ожидаем.Что(Аннотация.Состав.Количество()).Равно(1);
	Ожидаем.Что(Документация.Контейнер).Равно(Аннотация);
	Ожидаем.Что(Аннотация.Содержит(Документация)).Равно(Истина);

	ОсвободитьОбъект(Аннотация);

КонецПроцедуры

Процедура ТестДобавитьИнформациюДляПриложения() Экспорт

	Аннотация = Новый АннотацияXS;
	
	ИнформацияДляПриложения = Новый ИнформацияДляПриложенияXS;
	ИнформацияДляПриложения.Источник = "https://oscript.io";

	Аннотация.Состав.Добавить(ИнформацияДляПриложения);
	
	Ожидаем.Что(Аннотация.Состав.Количество()).Равно(1);
	Ожидаем.Что(ИнформацияДляПриложения.Контейнер).Равно(Аннотация);
	Ожидаем.Что(Аннотация.Содержит(ИнформацияДляПриложения)).Равно(Истина);

	ОсвободитьОбъект(Аннотация);

КонецПроцедуры

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("TestConstructor");
	МенеджерТестирования.ДобавитьТест("ТестДобавитьДокументацию");
	МенеджерТестирования.ДобавитьТест("ТестДобавитьИнформациюДляПриложения");

	Возврат Неопределено;

КонецФункции

#КонецОбласти