#Использовать asserts

Перем ЮнитТест;

#Область ОбработчикиТестирования

Процедура ТестИстина() Экспорт

	Ожидаем.Что(1).Равно(1);

КонецПроцедуры

Процедура ТестКонструктор() Экспорт

	ОбъявлениеЭлемента = Новый ОбъявлениеЭлементаXS;
	
	Ожидаем.Что(ОбъявлениеЭлемента.ТипКомпоненты).Равно(ТипКомпонентыXS.ОбъявлениеЭлемента);
	
	ОсвободитьОбъект(ОбъявлениеЭлемента);

КонецПроцедуры

Procedure TestConstructor() Export

	ElementDeclaration = new XSElementDeclaration;

	Ожидаем.Что(ElementDeclaration.ComponentType).Равно(XSComponentType.ElementDeclaration);
	
	FreeObject(ElementDeclaration);

EndProcedure

#Область ОбработчикиСобытийМодуля

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;

	МенеджерТестирования.ДобавитьТест("ТестИстина");
	МенеджерТестирования.ДобавитьТест("ТестКонструктор");
	МенеджерТестирования.ДобавитьТест("TestConstructor");

	Возврат Неопределено;

КонецФункции

#КонецОбласти