Перем ЮнитТест;

#Область ОбработчикиСобытийМодуля

Функция Версия() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	ЮнитТест = МенеджерТестирования;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестКонструктор");
	СписокТестов.Добавить("ТестУстановитьЯзык");
	СписокТестов.Добавить("ТестУстановитьИсточник");

	Возврат СписокТестов;

КонецФункции

#КонецОбласти

#Область ОбработчикиТестирования

Процедура ТестКонструктор() Экспорт

	Документация = Новый ДокументацияXS;

	ЮнитТест.ПроверитьРавенство(Документация.ТипКомпоненты, ТипКомпонентыXS.Документация);
	
КонецПроцедуры

Процедура ТестУстановитьЯзык() Экспорт

	Документация = Новый ДокументацияXS;
	Документация.Язык = "ru";

	ЮнитТест.ПроверитьРавенство(Документация.Язык, "ru");

КонецПроцедуры

Процедура ТестУстановитьИсточник() Экспорт

	Документация = Новый ДокументацияXS;
	Документация.Источник = "https://oscript.io";

	ЮнитТест.ПроверитьРавенство(Документация.Источник, "https://oscript.io");

КонецПроцедуры

#КонецОбласти